[{"sequence": "Bit of a wait at the door. No problem. Spicy kimchi ramen was good. Very good? Almost. Ginger ale float was dumb and basic. Broth leftover and they wouldn't sell me more noodles to put in it! Lame. I would return, but I would check out other spots maybe first.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.33388009667396545, 0.10081890225410461, 0.029536310583353043, 0.004846659023314714, 0.0009157129097729921]}, {"sequence": "Not sure why, but the shoyu broth and noodle here is way better than the Santouka in Vancouver. The pork jowl is absolutely delicious, but they're set aside for a reason. Don't put it all into your broth immediately (my noob mistake), or the first few pieces might taste delicious, but the rest will be overly tough while it's slowly cooked in the ramen broth. The aji tamago I added on the side was average at best (Over cooked and under seasoned? Marinated? ) ~$28 for the ramen + egg + cold tea... so decent pricing. I didn't like how they rushed you with the bill though when you're still working on your meal though. I did enjoy how they had a bar counter for the solo diners and the communal tables for the group diners though. Overall, a solid 4 star.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.1397339403629303, 0.024683702737092972, 0.0024585723876953125, 0.0019544886890798807, 0.0019520105561241508]}, {"sequence": "It should come to no surprise that I am a huge ramen fan. I had some truly amazing ramen in Japan and have felt ramen-withdrawal since then. There are some good ramen spots in New York City, but none of them serve tsukemen, which is one of my absolute favorite finds in Tokyo. Tsukemen, or dipping ramen, features cold, al dente ramen noodles that you dip into a hot broth, which is served on the side. When I found out that HRS served it, it went onto the calendar. BF had never had them before, so it was a first for him. I felt like I hyped it up so much beforehand. Thankfully, I think it lived up to the hype for him! We arrived around 6:15pm and had a 10-15 minute wait. We were the last couple in through the door before they required everyone else to start a line outside. It got very long by the time we left. I opted to start with a melon soda float, which the BF was skeptical of at first, but really enjoyed. I think he might have been his favorite part of dinner! We both ordered their non-spicy tsukemen and it was glorious - perfect al dente noodles with a tasty, hot broth on the side. I wish the broth was a little bit thicker so it would stick more, but I thoroughly enjoyed it. Quick tip for my fellow US travelers, they don't take Amex.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.29043102264404297, 0.19327768683433533, 0.05492829531431198, 0.030348055064678192, 0.006215371191501617]}, {"sequence": "WHAT TO TRY?!Their ramen!! Personally, liked their shio ramen the best because it has a rich creamy broth that is not like other ramen places. Can really taste the milky cream texture of the pork broth. Each bowl will come with two slices or pork so if you don't think that's enough, you can order the bigger portion sized one where they give you five slices of pork. They are really quick to serve your noodles shortly after you order. So don't worry about the lines! Because mean comes out very quickly!LAST TIP?! This place doesn't serve chicken or beef so they mainly only have pork broths and pork slices!! The vegetable ramen is on their secret menu in the kitchen so that's the only other ramen that doesn't have meat. And the portion size relative to Kenzo is smaller because the bowls are smaller. The prices are also more expensive than Kenzo so be aware!", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.1812891662120819, 0.025067737326025963, 0.010637515224516392, 0.005399021320044994, 0.0036446910817176104]}, {"sequence": "Came here on a Sunday at around 6pm and there was a short line up. We (partay of 2) waited for around 15 min with maybe 4 groups ahead of us which wasnt bad.. but when we came back out the line was like 3 times as long...I got the shio ramen which was really good! Broth was creamy (but I've had creamier) and the noodles were nice and chewy. So far prob one of the best ramens I've had in Toronto. Only thing I didn't like was the meat. It came with two pieces.. one was fatty which was good but the other piece was a bit too tough for my liking.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.226081982254982, 0.0815659835934639, 0.021616598591208458, 0.01033586636185646, 0.0028418805450201035]}, {"sequence": "3.5 stars... service and craft beer variety is a 4 star.  The food... it had some gaps sadly.  Those duck fat & beef tallow fries ... Amaaaazing.  Beer bistro has been known to be for a while.  If you think the craft beer halls is all new, you need to know that Beer Bistro has been around 10 years and serving up craft beers from around the world since then.  Ground zero would be here.  The space is quite large with a huge vaulted ceilings and a large patio off to the side.  I would say it reminds me of a nice upscale bar.  Casual but not your neighbourhood spot.  There is a bar area with a few large big screens.  So if your date is wanting to watch the hockey game and pepper you non stop with questions, you got your spot.  There is also an open kitchen into the dining room so you can watch your food being created.Service here is great... on point, always available, and pleasant.  They're incredibly well informed on the many beers that is found in their encyclopedia.  She was able to help tell us which beers wouldnt be our favourite knowing that what we liked.  They always checked in on us and kept our smaller table clean of used plates.As for their beers... good god, the book was insanely long but thankfully detailed in highlighting key tasting notes.  I loved how they have many different types locally but also internationally.  I also really liked how a lot of these craft beer were so affordable... none of these crazy $14 per glass for a Toronto craft beer.  Rather we found good Collective Arts ones for only $7.50.  I love this and I hope they continue this.Hog wild flat bread - You can smell the bacon and bbq sauce as it passes your table.  Thats what made us order this one.  It's a nice size for an app... good to share among a few people.  The taste was ok... the bbq was a typical sweet sauce with not a lot of zing or flavour.  The meat on it was a touch dry and not sure cause it was dried out in the oven.  The base was really dry and with no flavour.  It was more like a dried out biscuit.  It's decent bar food.  3/5Truffled potato pierogies - Another shareable app with crisped up pierogies with a few toppings.  The inside of the pierogies was a lot but not a lot of flavour.  It was just a lot of mashed unsalted potatoes.  I didn't taste any truffles or mushroom flavours through the dish.  Visually it was appealing but not sure if there was more to it.  3/5Spicy Red Thai mussels - A generous cast iron pot arrives to your plate and it's filled with plump and hot mussels.  Not a single one was closed or had broken shells.  That was very good to see.  There was enough broth on the bottom to soak up the sauce but for the beginning, it was so hard to try to get the top mussels any flavour because you couldnt just dig down to the bottom easily.  It would have been great if they could toss all the mussels into the sauce before serving.  First world problems.  Maybe Spicy Red Thai was the wrong flavour to get but this was not spicy... I wouldnt even say it was mild or even Thai.  No ginger, galangal, or spices that reminded me of Thai mussels I had at Kiin.  So maybe go for the other broths instead.  3.5/5Belgian Frites - THIS... is what you come for.  The beef tallow and duck fat fries are just so good.  Possibly one of my favourite in Toronto so far.  Tried Wvrst and Bellwoods which are considered other top Toronto fries and Beer Bistro is the clear winner.  Every fry is super hot, crispy, doused in salt, and nicely bronzed.  This was just well executed and they give you a huge cone of it!  Just delicious... Beer and Fries at Beer Bistro.  Hell ya.  I didnt even use the sauces they gave me cause it tasted good on its own.  4.5/5Not sure if the kitchen was off that day but clearly they got some things done well.  Those fries are amazing.  I have to give credit to the staff... just attentive service from a bar is always good to me.  Definitely a good spot to try a variety of beers without feeling the hipster judgement.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.9361966252326965, 0.929571807384491, 0.4294710159301758, 0.368339866399765, 0.31807270646095276]}, {"sequence": "2.5 (but that felt too harsh)Full disclaimer, the food lived up to the hype, the service is really where they took the hit (as well as the pricey-ness overall, but that is to be expected I guess). I made a reservation on a Friday for 5pm, and they told me only upon arriving that we had a two hour seating limit (not usually an issue, except our waitress had a bad habit of disappearing for 20 minute intervals between delivering food and drinks, but I digress). The place has a warm and hoppin' atmosphere with the bar side seemingly like a financial district watering hole and the dining room at the back being more formal. The \"featured beers\" prices vary A LOT (from $7.08 - $38.50 for single pours). The \"normal beers\" in the menu are much more reasonable and so tasty! The belgian fries are delicious and crispy, with homemade ketchup. The mussels are also great! We had the brussel mussels (spicy and a little sausage-smokey), and the english mussels (like a chowder, but less rich, and a nice bacon potato taste). They come with cold bread (that should definitely be warmed for such a nice place...the small things make a BIG difference!).THIS IS ABOUT THE SAD SERVICE (so feel free to disregard): Our waitress was THE WORST! She disappeared for long stretches and failed to check in. I had to ask for ketchup 3 times before it arrived at the table. She kept bringing food to the wrong tables, seemed angry when we wanted to order more food, or drinks and was surly and rude. While everything about the restaurant seemed to scream financial district decadence, their service made them seem like your subpar suburb diner). For those who watch the mindy project, imagine Beverly the nurse as a waitress....yep, that bad...", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.312289834022522, 0.14974266290664673, 0.1383388191461563, 0.032688479870557785, 0.02316734939813614]}, {"sequence": "Wide beer selection. We got 3 samples for $6. Blanche was light but tasted watered down. Also the duchess tasted a bit like sour wine.damn the belgian fries were good. Too bad the fries were short and small which made it harder to eat. It comes with a sweet ketchup and a garlic aioli dip yummmmI had the pulled pork pizza. The crust was similar to flatbread. It was good - thin but thick enough to hold up the toppings. The toppings were decent. Service was great. Our waitress cleared our plates promptly, refilled our waters frequently, and super friendly. Lovely atmosphere and great date place.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.8501995801925659, 0.008336052298545837, 0.0012316707288846374, 0.001100837136618793, 0.0008573809172958136]}, {"sequence": "My boyfriend and I dined here on a weekend for lunch. The restaurant serves their brunch menu until 3pm, so we took advantage and ordered $3 beer mimosas. You can't go wrong with mimosas. The staff are well educated on their beer offerings and the food. We had great service from the beginning of our meal to the moment we left.We ordered a large bistro salad, the fries, and the spicy red Thai muscles. The salad was perfect to share, it had a good dressing and variety of veggies. With no protein, I probably wouldn't order this as a main. The Belgian frites were phenomenal. Blanched in beef tallow and duck fat, and served with house made mayo, they were probably some of the best fries I've ever had. Perfectly crunchy, salty and very flavourful on their own. The muscles were cooked in a flavourful broth with peppers and onions. They were tender and a little spicy and came with sourdough for dipping. If I dined here again, I would have a very difficult time ordering something else off the menu. I loved each dish we tried and would highly recommend them!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.9313189387321472, 0.060769908130168915, 0.027047637850046158, 0.026717575266957283, 0.022263001650571823]}, {"sequence": "This place is super cool! They have over 22 beers on tap, 100 different bottles of beer, and lots to beer infused food. If you food and beer this is the place to be! The servers and chefs are so also very knowledgeable about the menu they have whether it's food or beer or pairings. They also have a patio on the side of the building. It does get much sun because it's between the two big buildings, but it's still nice. We order a Belgium beer with white sauce mussels and also a pulled pork burger. It was so delicious !", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.9846222400665283, 0.03774802014231682, 0.0018859137780964375, 0.0008519303519278765, 0.00033690640702843666]}, {"sequence": "Pretty good! I've noticed the most of the menu are deli meats but nonetheless tasty and has cute packaging. Have returned a couple of times just to be able to try other things on the menu. The flavours are unique and so delicious", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta"], "scores": [0.08887369185686111, 0.019098643213510513, 0.004211504478007555, 0.003226891625672579, 0.0005551094654947519]}, {"sequence": "Have always passed by but never bothered trying even though I knew it has exceptional reviews.Tried today and proved that I was right, mediocre food not better than any food court food. If being filling is the most important criteria then this lace gets 5 stars. However in terms of creativity/skills, this place is no different than a Pita Pit to me. Their crepes are so thick that resembles a pita bread indeed. They have a lot of fillings, I guess that's what many people like.BUT that's it! Nothing really creative or requires any special skills what so ever. Even their choice of fillings are sooooo generic like a Subway has.I would say this is more of a Pita Pit/Subway kind of food, is it even better than that? I would not think so. I am so surprised that how a place like this is so highly rated?!?! ‍Torontonians have an urgent need to be exposed to some real good food...man...That said, go for it if your are starving though. Oh, and their staff is friendly", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.3287983536720276, 0.09902365505695343, 0.04187483340501785, 0.019485676661133766, 0.018849428743124008]}, {"sequence": "The crepes were tasty but extremely small IMO. Maybe this is perfect for someone looking to grab a quick bite but not as a full meal. It also seemed a bit pricey to me as one crepe is $11. I'd probably come back if I'm craving crepes but I'm there that that there's a lot of other food options.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.3504563868045807, 0.04580337926745415, 0.04517213627696037, 0.022139832377433777, 0.008796663023531437]}, {"sequence": "Still delicious, but I need to drop my score to four now that they are reheating the crepes.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.5056266784667969, 0.03173500671982765, 0.002199884271249175, 0.0006257097120396793, 0.0003780425467994064]}, {"sequence": "Came here for a late snack on a Wednesday and it's was fairly busy. Pros:- Well priced - Good taste - Professional serviceCons:- Prices on website are outdated (they're about 40% more expensive)", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.663175106048584, 0.536376953125, 0.4164722263813019, 0.25264135003089905, 0.004309475421905518]}, {"sequence": "Preface: this review is for the dinner experience, NOT the dim sum experience (which isn't offered in the evenings).When we first walked in, we noticed two things. First, the decorations. The whole restaurant is covered in gold and white cloth, from the floor to the chairs to the tables. The servers are all wearing fancy suits, and there's even a wall with a ton of wine bottles. It's not fancy like a steakhouse, but it looks nice, rather than faux-fancy. And second, we noticed the seafood tanks! You can observe the live seafood swimming and crawling around, including king crabs, lobsters, fish, shrimp, and geoduck (one of the largest edible clams!). They were all a lot of fun to watch.Once we got to our table, we were presented with a challenge: navigating the menu. There are TWO menus, each containing well over 100 items, and many of them don't have clear prices. On top of that, some of the items were only in Chinese. If you're not Chinese yourself, figuring out what to order can be quite complicated. We asked for advice from our server, but that didn't help us narrow down - it just left us with even more options. It seemed like some of the dishes were more authentic, whereas others were more \"tourist-friendly.\" We ended up getting the \"dinner for 4\" (the one with BBQ pork, since there are two different \"dinners for 4\" - one per menu), plus some fresh scallops.The dinner came with multiple different dishes which we shared family-style. Some of them were great, such as the soup, the BBQ pork (which was the highlight), and the stir-fried shrimp. Some were just ok, such as the scallops and the fish. Others were disappointing, such as the bok choy and the dessert. I think there's a bit of a learning curve - you need to figure out what's good (and what you like) in order to maximize your enjoyment.Overall, the meal was certainly unique, and on the whole we had a good time. But the confusing ordering experience and the hit-or-miss nature of the dishes made it not as great as it could've been. If you know what you're doing, then you'll probably have a good time here. If you don't, then just be flexible and prepared!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.042846567928791046, 0.022896692156791687, 0.021317986771464348, 0.018549511209130287, 0.0010590365855023265]}, {"sequence": "Very good Dim Sum i highly recommend this place for Dim Sum . Clean , tasty and well served ..excellent atmosphere .. respectful crowd .. serious foodies ( for sure .. )i loved every dish .. Clean restrooms .. Good service. NO Dim Sum carts here .. ( you order a la carte and they will bring it to you from the kitchen .. )staff looked a little stressed out .. Tip : They have happy hour Dim Sum at reduced price if you get there before 11:00 am ..  i shall return soon ..", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.014094063080847263, 0.0010916258906945586, 0.0004066622641403228, 0.000184581644134596, 0.00011137162800878286]}, {"sequence": "Came here on Feb 18 Family day holiday just before 9;40 a.m.. The place is packed. Waiting area is too small for the amount of people wating. People went to the dining area and stood waiting by the walls.Got seated around 10:40 am.Food is okay for the most part. The items are super sized, ie har- kow which are usually an inch round dumpling are about 1.5 inches in size.We ordered 10 items, varying from small to large including 1 special - the fried octopus tentacles. Total came to $63 with tax.Unlike a previous post, the early bird discount does not apply on weekends and holidays.We ordered Har-kowSiumaiBeef rice rollsChicken feetSteamed pork bunFried seaweed roll with shrimp and fish - these came out as 3 pcs of 6\" baton sticks rather than the maki roll bite size pieces in other dimsum places. Like I said - Super-sized!The dishes I feel is a little subpar are- Fried shrimp ball with almonds - this is nothing like any fried shrimp ball from other places. I thought it would be similar, just different coating, but its not to my liking, it doesn't have enough shrimp flavour.- the octopus tentacles (SP) - not crispy enough, some were even chewy. - the fried sticky pork dumpling - dough ratio to filling is a little thick. Also it was not hot nor crispy on the outside.I have no complaints on the service despite them being busy. We were able to get additional hot sauces and hot water  as our need arise.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.11509782075881958, 0.0317351259291172, 0.02957061491906643, 0.01997806318104267, 0.008914623409509659]}, {"sequence": "We went here for dim sum at 1pm on Saturday and this place is packed!! We made reservations and still had to wait around 20 mins for a table. The food is quite tasty. My favorite was the bbq pork and the shrimp dumplings. The bbq was juicy, perfect amount of fat, and 9$ for quite a good portioned plate and rice or noodle. The shrimp dumpling was very big and was packed with large pieces of shrimp.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.004950827453285456, 0.0012292974861338735, 0.0011108415201306343, 0.00040456047281622887, 0.00019842555047944188]}, {"sequence": "I just want to start off that the rating is just for the food and not for the service. If I were to weight it, the average would be a four since service was about a three--Service was slow and very few English speakers. The people who we were able to talk to were professional but it was so busy that it was hard to get their attention.My wife and I really liked this restaurant's menu which was quite extensive compared to other Dim Sums. The food was great! I wouldn't say it was the best Dim Sum I've ever had but it's hard to compare. The thing we liked best was the uniqueness of some of the dishes. Most of the Dim Sum places around my hometown serve similar items to other cities we've been to like in L.A. or N.Y.C., almost cookie-cutter Dim Sum. But this place had a lot of different and new dishes that we had never seen before. Presentation (food and plating) was nice and everything tasted delicious. We got there at about 2pm on a weekday and it was still busy. I think it remained packed during the time we were there but it seems the staff was used to it. I think if you're going to try this place you have to come with the expectation that you're gonna get good food at a slight hassle (slow service and long wait times).", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "A cafe that also offers beer"], "scores": [0.36430007219314575, 0.3250790536403656, 0.20382159948349, 0.18800242245197296, 0.14082024991512299]}, {"sequence": "My absolute favourite restaurant in Toronto. It could definitely get expensive if you're a big eater but it's so worth trying for a special occasion.Their nigiri sushi and jabistro rolls are good but the absolute must orders are the aburi/pressed sushi selection. So creamy it literally melts in your mouth!! Seriously so impressed with everything I've tried from here. Con: parking is pricy bc of location; subway there if you can!5/5!!!", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea", "A cafe that also offers beer"], "scores": [0.09000680595636368, 0.01004314050078392, 0.009871167130768299, 0.0024856007657945156, 0.0017899033846333623]}, {"sequence": "You can go wrong, with the large chef  sashimi platter super fresh and their signature aburi, one of my go to spots for sushi, highly recommended to come after 8 if your not making reservations,", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.004931323695927858, 0.0015632646391168237, 5.970330676063895e-05, 5.2810901252087206e-05, 2.7676434910972603e-05]}, {"sequence": "I have been to JaBistro multiple times and the food is always excellent. Fish is very fresh and prices are reasonable for the quality that you get. The service is excellent as well.However, the place is small and it can get pretty busy unless you arrive early.", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.005232310853898525, 0.0026657935231924057, 0.0023716825526207685, 0.0008156006806530058, 0.0005219317972660065]}, {"sequence": "I'd preferably want to give them 3 1/2 stars. This used to be one of my favorite places with their sushi platters. Over the years, new Japanese restaurants have popped up that are more innovative. Jabistro is still yummy but their core menu hasn't changed at all. First off, my fav is their lobster sashimi platter. It's not stated on the menu but it comes with lobster miso soup either for 2 or for 4, depending on the size of the platter. The variety of sashimi differs depending on what they have that day. My most recent experience had toro and chu toro. yumThe agadeshi scallop was disappointing. Wish they had the sauce on the side instead of already served.scallops were soft and soggy too quickly.Also ordered the aburicious. I recommend this for all first time goers to try out their four types of torched sushi.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.08081265538930893, 0.007625213824212551, 0.005334888584911823, 0.0018464955501258373, 0.0017671509413048625]}, {"sequence": "If you're looking for mouth-watering, melting in your mouth sashimi, this is the place for you! Although pricey and on the higher end of restaurants, this place is worth every buck. Came here for my birthday last weekend and we loved it! The waiter was very patient as it was our first time and we weren't sure what to order. We ended up with favourites that were recommended by our waiter. Started with the hakkaido salad and sashimi platter to share and each got our own kyukyoku and aburi. Note: should've shared the kyukyoku and aburi as well; having our own was way too much food (although we did finish it all). All 4 dishes were amazing! Great presentation and variety. The sashimi melted like butter in our mouths. Did I mention this place was worth every buck? Our dessert was the creme brûlée and green tea ice cream. As the biggest creme brûlée enthusiast, this made it to my top creme brulees in the city! Loved it! JaBistro does their version for winterlicious and summerlicious twice a year. Where you can get 5 courses for $77. Although we didn't do that this time around, would love to come back and try that. Overall, 5 stars for this restaurant!", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.14123262465000153, 0.05119932070374489, 0.04859108477830887, 0.006696256808936596, 0.00497948843985796]}, {"sequence": "This place is awesome! The dumplings are made fresh! And boy, are they delicious. I've tried steamed and pan fried dumplings. Both were so delicious and fresh. The pan fried dumplings do have a bit more saltiness and flavour but I just love a good boiled dumpling! The green beans were just amazing salty goodness! The chines broccoli was a bit bland. Most places will make them super garlicky, salty and greasy... here there was barely any garlic, so it tasted a bit more bland, but probably healthier that way anyway. They have a couple of beers on tap and a few more to select from in a bottle! Service is super quick. I'd come back here for dumplings any day!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.8264243602752686, 0.03133166581392288, 0.01703675091266632, 0.003764600958675146, 0.0025273796636611223]}, {"sequence": "Party of 6. 45 minute wait on a Friday night, but we really only waited less than 20 minutes. It certainly satisfied my dim sum fix. Since there were so many of us we got a bit of everything. Standouts for me were:Pancakes - all of them are goodBBQ Pork BunsPork & Bok Choy Dumplings", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.02063240483403206, 0.00029868303681723773, 0.00023483610129915178, 0.00019575428450480103, 0.00018805716536007822]}, {"sequence": "Really good quality food all around. Had the pork and chive boiled dumplings, bbq port steamed buns, and spring roles. Dumpling broth was tasty, bbq was sweet and savory, spring roles were crispy and fresh.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.44055846333503723, 0.0031258261296898127, 0.0005366375553421676, 0.0003078507725149393, 0.00012883488670922816]}, {"sequence": "When you're visiting an \"authentic\" Chinese restaurant you would think it's going to be great, but unfortunately this was far from it. The first course consisted of \"soup dumplings\" that were so shriveled they resembled more of a pork dumpling, with shit tons of ginger. The shrimp and chive dumplings were topped off with a hair (photo attached) and when I told the server he did nothing. I had to ask for another plate, and comps? Yea nothing there. The cherry on the sundae was the salty beef and broccoli served with undercooked rice. Honestly, what Chinese restaurant fucks up white rice? Add on a store bought teriyaki sauce and there was my meal. Shit show to say the least and the wait staff did nothing. TLDR:Stop by if you want hair on your food, raw rice, and incompetent servers. But come for the tea! That was great", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0012954830890521407, 0.0010041621280834079, 0.0003662079689092934, 0.00018412279314361513, 5.948194666416384e-05]}, {"sequence": "Excellent authentic dumpling house. All the food was delicious. Small place but worth it.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.0011667832732200623, 0.0008462194819003344, 0.0002489979669917375, 0.00014264292258303612, 5.3051124268677086e-05]}, {"sequence": "Parking - very limited space if you come here on the weekend. You're better off parking somewhere further (like pmall or the plaza to the south) and walk over. About this place  - small. Limited seatings. Turnover is somewhat quick, so you might be able to snag a  spot along the window. Otherwise, take it out and enjoy elsewhere. Staff on hand is very friendly. Super friendly. They want you to enjoy your time here. It was super busy and all seats were filled.I was eating my burger standing by window. Eventually people left and seats opened up. I was personally brought a stool to sit on! If that's not friendly service, I don't know what is. Food - the don katsu burger is huge and will definitely fill you up. It's too big to pick up and eat without it being messy. Batter wasn't thick at all. Tastes great overall.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.3796337842941284, 0.11018124967813492, 0.06962914019823074, 0.04410950839519501, 0.01595189794898033]}, {"sequence": "I love Kastu, it's such a basic concept. You get a thin slice of meat and then you coat it in egg wash then coat it in breadcrumbs before you fry it. I love doing it at home so part of me wondered how good can Fat Ninja Bite's Katsu be? Well it's amazing! Their Katsu is just the flakiest yet light and crispy. It's crazy delicious.We went and tried their sandwich with the chicken Katsu in dark meat and the pork Don Katsu with rice. I'll tell you now that the sandwich was a clear 5/5 while the rice was 4/5. The sandwich has so many components to it and together was more hormonious.  I also preferred the chicken over the pork. Even though the pork was indeed tender, the chicken was juicier and a lighter chew worked better. The sandwich had tomatoes, lettuce, slaw, and even pickles, brought together by a nice spicy mayo. As you've seen the cutlet itself, is way bigger than the bun itself, we ate the second cutlet on it's own. What I really liked was their sauce. It's sweet and slightly tangy. It resembles something of a teriyaki sauce and it's excellent. The rice plate was more ordinary and just featured the Katsu with rice and slaw. Again, you get two cutlets, and there's a ton of food here. The slaw is pretty ordinary, it would be interesting if FNB offered a more traditional thinly sliced and lightly dressed cabbage slaw instead a mayo based one.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.09364179521799088, 0.08384332060813904, 0.027385661378502846, 0.018501505255699158, 0.006358461920171976]}, {"sequence": "Finally had the opportunity to try this place and it definitely lived up to the hype! Located in a smalllllll plaza with very limited parking. If parking is full, just park in the plaza right beside it and walk there. Small shop with one table that fits 3-4 people facing the open kitchen and bar tables along the windows. We ordered the chicken katsu burger and katsu rice. The chicken Katsu was huge and can easily make 2 burgers, I believe you can also have them cut it for you and have double layers in your burger. The pork katsu was very nice as while. Both were very flavourful and filling! Came with coleslaw. Food was made fresh and did not take long at all.We also got to sample the tarp chips! Very deliciousWe definitely go back to try the different items on the menu.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.22258083522319794, 0.09682580828666687, 0.04756857827305794, 0.02571229264140129, 0.004760674200952053]}, {"sequence": "Definitely one of my favourite places now! Came here the other day to get lunch with one of my friends and we both fell in love. I got the chicken katsu (white meat) and wow it was amazing! The burger itself was huge and they gave a side of coleslaw with it. It was around $12 which was a good deal.The staff were super friendly and always had a smile on them. Parking is super tight in this plaza, so you might be waiting a bit outside if you want to dine in. Also, there is limited seating inside. The restaurant itself is really clean inside. However, the washroom is small. I will definitely be back and I will recommend this place to others.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.1704981029033661, 0.120254747569561, 0.0730842649936676, 0.033494725823402405, 0.011410596780478954]}, {"sequence": "AMAZINGGGGGG. I was so very satisfied after eating my bulgogi burger. Just be warned that it's def messy, but 100% worth it! I also tried a bit of the chicken Katsu and it was perfectly breaded, perfectly crunchy and still soft.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.21286186575889587, 0.0035527057480067015, 0.0019387429347261786, 0.000589798204600811, 7.538284262409434e-05]}, {"sequence": "I came here on a beautiful evening and sat outside on the patio during the week.  It was quite busy, and although along a side \"street\" in the Distillery, there was a lot of activity.  The atmosphere was amazing, from the pretty Parisian decor, to the waitstaff that made you feel like they were your friends.  We enjoyed some wine and cocktails, oysters and the french onion soup.  Everything tasted magnificently.  A great place for a get together with friends, a date, or whatever occasion you'd like.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.1187036782503128, 0.013647216372191906, 0.010820012539625168, 0.001998454798012972, 0.0006035384139977396]}, {"sequence": "Had the Scallop Crudo to start and it was absolutely delightful. It looked so good that I didn't take a picture and just ate. Followed by fresh local oysters, fresh, sweet and clean.Entree was the filet mignon with frites. Good medium rare on the steak but was more on the salty side.. tried to dip it in the demi glacé to wash some of the salt away but didn't really work.Shoestring frites with the lemon garlic aioli was delicious!If I were to come back I'd definitely try the fish entrees seeing that they excelled at the appetizers.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.17533423006534576, 0.005581639241427183, 0.0032766961958259344, 0.0027325775008648634, 0.0010717626428231597]}, {"sequence": "To be honest, I don't see what the hype is about. The food wasn't all that tasty. Head over to Sukho Thai in toronto for some real tasty food.Head over to somewhere like Sukho Thai in Toronto. The food will blow your mind. Get the khao soi beef.The inside is very old school and outdated and perhaps that is part of the charm, but to be honest it's not that visually attractive unless you're in your 50s or 60s and you want to be reminded of an old-school restaurant or Brasserie.This place is all hype. Avoid it.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.12086672335863113, 0.04019881412386894, 0.011946272104978561, 0.007887323386967182, 0.00326199596747756]}, {"sequence": "Came here for a friends birthday brunch and the staff was accommodating and helpful especially with a large group. I ordered the cod Benedict which was delicious but very small and quite expensive. Nonetheless, it was good. Some friends ordered the French toast which was rich, sweet and super soft - it was like having a Cinnabon! The fries were also delicious. Best of all, I liked the fact that if you order a bottle of French bubbly, you can get $1 oysters. The oysters are small but still fresh - and I loved the oyster hot sauce!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.11955875158309937, 0.0032034956384450197, 0.0005212107789702713, 0.0004677895049098879, 0.00013066965038888156]}, {"sequence": "I went to this place for dinner after the Christmas market and i was very pleased!The restaurant Interior is beautiful and provided a really fantastic vintage dining experience.For dinner I ordered the Truffle Half chicken and The Hanger Steak. The chicken was very tender and moist with a hint of truffle oil - served on top of a bed of roasted potatoes and carrots that nicely soaked up the roasting pans juices. The hanger steak was cooked to my liking - medium rare. The herb butter and the au jus that came with it was a match in heaven. The blend of herbs and seasoning they use on their skinny fries was very unique and tasty.I would definitely recommend this place.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.12262782454490662, 0.03057076781988144, 0.01633366011083126, 0.014326594769954681, 0.001702174893580377]}, {"sequence": "Visited this Toronto famous pizzeria a few weekends ago during their down time around 3ish on a Sunday. I know there are a few around the city but wanted to try the original.The staff was nice and we got a table by their front open window which had a nice breeze and gorgeous view of their restaurant. We ordered their arancini and nduja sausage pizza, the arancini was crispy on the outside, warm and gooey on the inside with amazing tomato sauce to top it all with. Fresh and still making my mouth water now. The pizza on the other hand was disappointing... the dough in the middle was soggy and seemed a bit underdone. The cheesy which I wished was gooey was very watery, which explains the sogginess. The crust itself was delicious and chewy like it should be but if we had more time I would have said something to our waiter. Or if he had come back to check in. Ended up paying at the counter. A bit disappointed with this visit but thought maybe it really was a down time.", "labels": ["Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "A cafe that also offers beer"], "scores": [0.0502704381942749, 0.01068658847361803, 0.005537835881114006, 0.004101432394236326, 0.002669240115210414]}, {"sequence": "short wait on a Saturday (20 mins) is always a great place to start.Every single person we interacted with was lovely, and attentive. You cannot ask for more than that.The restaurant was buzzing when we arrived at 9ish. Good vibe, staff looked to be having a great time. We ordered Caprese salad & Calamari to start and 2 pizzas for our main.Calamari was fantastic, better than average (for battered calamari) with a larger than average portion, also great. Odd that there was no accompanying sauce (aoili at least?)Caprese - This is a very, very poor and somewhat sad version of this Italian standard. Enormous thick slices of Beefsteak tomatoes inter cut with small thin slices of bocconcini. The ratio was off. The markup on the ingredients is assinine - from roughly 80 cents for the tomato and $1 for the bocconcini used to over $10. Very little olive oil, basil. No salt, pepper, oregano or dried seasoning of any sort. This menu item deserves better. This is Chef Boyardee in its overall presentation. The dough/crust on the 2 pizza was delightful - top quality. Didn't love the sauce, absolutely missing key spices and/or some salt. Objectively speaking the cheese is sub par. The fresh bocconcini isnt to the standard that should be used for a stone over pizza. Thank god the basil was there to help in our pizza's time of need.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.07204769551753998, 0.008131764829158783, 0.006390285212546587, 0.005016085226088762, 0.0021551798563450575]}, {"sequence": "The food was great but worst service I have ever had. Came here with my family for my birthday. We started by ordering 2 bottles of wine, arancini balls, and the kale salad. The salad was amazing. Some waiter came by and threw the arancini balls on the table and did not say a word, I didn't even notice they had arrived. Later our server almost spilt a glass of wine all over my boyfriend and did not even give a simple apology. She was very rude as every time she brought food she would throw it down on the table and just walk away... not a word. She was very impatient and when we would ask for advice she would say she didn't now. If you can get past Horrible service I recommend this place as the food was very good but I think they need some new servers. Worst I have ever seen anywhere!", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.45190978050231934, 0.31806680560112, 0.14950653910636902, 0.023613980039954185, 0.021311338990926743]}, {"sequence": "We've tried the duck confit pizza and the nduja sausage pizza on past visits here - both are delicious! Ingredients used are fresh and you taste that in each bite. My only complaint is that I wish they put more meat on the pizza overall but that's my personal preference since it seems authentic Italian pizza is skimpier on the toppings in general.The place is always busy so be prepared to wait for a table if you're doing walk in or you could always do takeout, which is pretty efficient too. Service is good though and my friend even got a free tiramisu from a nice server! We'll be back again!", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta"], "scores": [0.21209301054477692, 0.03751755133271217, 0.020146310329437256, 0.005899705458432436, 0.004568756558001041]}, {"sequence": "My number one favourite pizza place in the Queen west area! I just can't get enough of their duck confit white pizza with a glass of Pinot noir! Yummy! Also the beef carpaccio is just a must! Try it with arugula for a full experience!The ambiance is also very smooth and I can bring my one month old baby who's enjoying the white noise :)The only con is that I have to keep myself from going every single week!", "labels": ["Italian place with a burger", "A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.001456400379538536, 0.001239132252521813, 0.0004884970840066671, 0.00024332125030923635, 6.726765423081815e-05]}, {"sequence": "One of the best dining experiences in Toronto to date. My parents, brother hubby and I came here in the summer for a special dinner celebrating my mom's birthday. We had a reservation and were seated upstairs, both dining areas were gorgeously decorated... very European in feel!We ordered the: Spanish Octopus (So good, we ordered a 2nd order) spiced with smoked paprika it was slightly crispy on the outside but buttery soft on the inside!Crispy baby artichoke, a rare way to eat artichoke and boy was it a treat! Served on house made labneh.Mushroom pita/12 hour braised lamb and kale, black bean and lentil rice were all thoroughly enjoyed as well!Middle Eastern Fried Chicken, family really enjoyed this they said it was crispy on the outside and the hot sauce and tahini added tons of flavour. Grilled whole branzino was light, flakey and delicious.For dessert we tried the Loukoumades (honey balls) which were light and so delicately sweet, and the Pavlova which was such a nice treat when the meringue was cracked open. My mom tried and loved the rose's shadow which was Pomegranate, lemon juice, rose water, and hibiscus.The service was attentive and consistent, top notch!My only complaint was that it was uncomfortably warm upstairs throughout the meal. but won't deter me from returning :)", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.06134910508990288, 0.05682845786213875, 0.014622700400650501, 0.00461947126314044, 0.0029447937849909067]}, {"sequence": "Amazing food and amazing service!!! The atmosphere alone is five stars,  it's downstairs and up.  (We sat upstairs at a corner booth for two..charming!)We ordered seven plates between us, (we just wanted to try everything that sounded interesting to us but we would have been good with only four), and  all were complete stand-outs except the rolled couscous.  (Skip that one:  dry and bland, even with the toppings from other dished added)But DO NOT following:Eggplant/manti dumplings!!!!  OMG!!!The fish baked in yogurt sauce is amazing!The labne with honey and beetsThe lamb ribs!The cauliflower and the marcona almonds are both also very nice to have but the four above are originals here!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.31587350368499756, 0.023872224614024162, 0.012419783510267735, 0.003788979025557637, 0.000732367392629385]}, {"sequence": "My mom and I came here before the theatre and it was an amazing meal full of unique flavours.I would definitely go back and try a meat dishMy favourites were the Turkish Dumplings, Fig salad and the Loukoumades for dessert.The Turkish coffee was also really good.The black truffle pide and the mejadra rice were nice but I would probably try something different next time.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.06829436123371124, 0.005206249188631773, 0.002467106096446514, 0.0017204817850142717, 0.0004398263117764145]}, {"sequence": "This was our first nicer dinner when we came to visit.  Guess we just got a slow start!Everyone we encountered was very pleasant and accommodating. I was soon mesmerized by the way one of the chefs created the labneh \"well\" in the beet and crispy baby artichoke dishes. I eventually worked up the courage to ask his permission to take a Boomerang.  He kindly obliged.To start, we ordered the beets, the steak tartare, manti dumplings and Spanish octopus. Though they pretty much put their dukkah on everything, it was delicious and I didn't mind it one bit.  The steak tartare and the octopus were my two favorite starters.  The steak tartare was one of the best I've had.For the mains, we ordered the crispy duck confit rice, short rib kebab,  whole branzino along with a side of the seared cauliflower.  To be honest, we weren't HUGE fans of the entrees.  The appetizers were, to us, more impressive.  Also, our server had mentioned she would course everything out for us so that not everything came at once.  But when ALL our entrees came at once and I commented to her, all she said was \"Yep, they're all here!\"The crispy duck confit rice was pretty heavy on what tasted like star anise but I really enjoy the texture.  The short rib, for whatever reason, came lukewarm. I took food photos but I'm generally a one-and-done type photographer (not high caliber) so it doesn't explain why the short rib was already lukewarm by the time we dug in.  The fish was ok...somewhat on the fishy side...but the saffron sauce which I was apprehensive about ended up saving the dish.Dessert was another highlight of the evening.  The pavlova was a foregone conclusion due to the theatrics of cracking it open but it ended up being supremely tasty as well.  First meringue I've had that was tangy and not cloyingly sweet.  We also got the baklava which we had totally discounted thinking it was heavy. On recommendation from our server, though, we decided to give it a go.  It was amazingly light and delicious as well.Overall a good meal...and I would probably come back if we were ever in town again (hopefully)...but I would probably cobble together dinner from among the appetizer section or try other entrees.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.1489345282316208, 0.07380091398954391, 0.043765269219875336, 0.041163306683301926, 0.023184286430478096]}, {"sequence": "An absolutely exquisite meal! Came here with a party of three... Although my expectations were high coming into the restaurant, the food still well exceeded my standards. I was completely blown away! We reserved our table well in advance (a month ago), so this was a long awaited meal.The waitress told us that the style of Byblos is sharing plates, and that roughly 6 plates would be needed to serve the three of us. Naively, we told her that since we had small appetites, we shouldn't need six plates. Little did we know... The food was so addicting, and the portions were fairly small, leading us to order round after round after round.We started off with a couple appetizers, outlined below.Turkish Manti Dumplings:I've heard so many different things about this dish - some people love it, others find it too bland. We loved it! The flavours were super complex; although being completely vegetarian, it didn't taste it at all. The eggplant had a rich smokey flavour that accentuated the dish. The creamy halloumi and tangy yogurt balanced the salty flavour of the eggplant. I didn't really taste the sweetness of the molasses, and really enjoyed the crisp dumpling surface contrasted with the creamy sauce. Fig Salad:The first and foremost flavour that jumps out at you when eating this salad is the floral taste, stemming from the orange blossom vinaigrette. The tangy vinegar had a very delicate blossom undertone; I could truly taste the fragrance and perfume of the orange blossom. The figs added a nice touch of sweetness; however, there were very little pieces. When we brought that up to the waitress, she was kind enough to accommodate and brought us a dish of a fresh fig cut up. The fig was delightfully fresh! I liked this salad - however, given its high price point, it was a small portion with few ingredients.For the mains, we had a variety of different dishes such as the following.Tah-Dig:This is a classic Mediterranean dish with crispy rice, and surprisingly small for its ingredients and price (I think I'm seeing a trend). That said, the rice was addicting crispy and delicious! The lamb was braised to be fall apart tender, and the warm figs highlighted and lightened the meal. The nuts were a nice addition. Grilled Whole Banzino:This was by far my favourite dish of the entire meal! It was my first time having chermoullah, a pesto-like savoury salty sauce. The parsley and cilantro green dressing with the lemon juice really lightened up the grilled fish. The skin was also the right amount of crisp. I was amazed by this dish, and ate every single last piece.Ora King Salmon:We didn't have enough, and so ordered this additional protein. The four pieces of salmon were grilled to a perfect char, rendering the skin crispy. Meanwhile, the salmon was cooked just right - the inside was moist and tender. It was the perfect pink, and by no means dry. The harissa sauce was a lovely spicy addition. Though good, it didn't stand up to the banzino for me.Crispy Hand Rolled Couscous:This dish was very similar to the Tah-Dig in that it was likewise crispy. That said, I enjoyed this dish so much more! The creamy halloumi with the collard greens was absolutely delicious. I'm not a fan of cheese, but this and the Manti Dumplings really won me over.We ended the meal with a dessert. We couldn't decide between the baklava and pavlova (both executed in fusion style), but the waitress recommended the baklava.Stuffed Baklava:This dish had mint ice cream stuffed inside crispy pastry (similar to a cannoli), sprinkled with pistachios and topped with a dark chocolate mousse. It was an interesting mix and juxtaposition of flavours and textures - the crisp of the pastry and pistachio contrasted with the creamy mousse/chocolate and ice cream. The sweetness of the dark chocolate and ice cream was cut by the sudden addition of sea salt. To be honest, this dessert wasn't my favourite as the salt caught me off guard. However, I did enjoy the dark chocolate and pistachios. Most certainly an interesting dessert style.This place is quite pricey, so save up! Moreover, come with a larger group to both split the cost and share more things. Next time, I will definitely try the pavlova (the table next to us seemed to thoroughly enjoy it) and the sweet jewelled rice!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.49795234203338623, 0.49117404222488403, 0.25855177640914917, 0.21870705485343933, 0.1894194632768631]}, {"sequence": "This is one of my top brunch places in Toronto. It is extremely busy on weekends and they do not take reservations. As with most other popular brunch spots in Toronto, you will need to come really early to avoid a long wait. My favorite items here are their eggs Benedict. I absolutely love the home fries that it comes with. These home fries are covered in a sweet bbq sauce and they are just so tasty and perfectly crispy on the outside. The hollandaise sauce on the eggs are also very rich in flavor and creamy. I've tried several including the \"Manami Eggs Benedict- eggs Benedict on curried patties\" and this was probably my least favorite. This was different so I wanted to give it a try but I find the curried patties to be a bit dry. My personal favorite is the \"Memphis Eggs Benedict- eggs Benedict with bbq pulled pork\". The portions are huge and the home fries definitely make the whole dish really filling. Insomnia have good eggs Benedict, great service, and reasonable price.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.11750338971614838, 0.020990652963519096, 0.006989756599068642, 0.006562685593962669, 0.005366439465433359]}, {"sequence": "Came for a friend's birthday, and I thought it was unique, considering downtown, that such a quaint and homey restaurant was capable of sitting a party of 15+. However, this was the only positive of my experience here. I got the small mixed greens & root vegetables salad, which was lacklustre in taste. There was no dressing, and I tasted only 2 pieces of butternut squash. It was not filling at all, and consisted of mainly only salad leaves. My friends got the Insomnia burger and it was a tiny burger that did not even come with a side! Considering the price of the burger ($14), I think it should be customary to include a side. Other than the limited quantity and low quality of food, the service was horrible; our waitress was so rude! We thought it might be because of the fact that tip is automatically added onto the bill of a large party, as we saw her have a friendlier demeanour with other tables.Verdict: Will not be coming back here for food. Better off to try other places in Koreatown, you'll definitely have a better experience.", "labels": ["Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.4664226472377777, 0.27225449681282043, 0.24477586150169373, 0.17441916465759277, 0.019931936636567116]}, {"sequence": "TL;DR Great brunch for a good price, come early!We lucked out coming on a Saturday at 11AM with only 10 minutes of waiting. We recommend the General BLT Sandwich, and less so the Memphis (pulled pork) eggs Benedict. Both came with a spring mix and potatoes. General BLT 5/5 Amazing sandwich. One of the best we've ever had. Thick pea meal bacon with an egg, soft bun, fresh tomatoes, and a powerful garlic aioli. SO GOOD. The potatoes and side salad were lovely too.Pulled pork eggs Benedict 4/5 The eggs were perfectly runny, in a great hollandaise sauce. Our only issue with this dish is that it's a little too sweet. The pulled pork is tender, however its sweetness was similar to that of the sauce on the potatoes. This made the dish pretty unidimensional for us. We don't recommend it if you don't have a sweet tooth. Will definitely return and try a few other dishes!", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.30962061882019043, 0.02980566769838333, 0.014506190083920956, 0.013861370272934437, 0.009489204734563828]}, {"sequence": "AMAZING ATMOSPHERE.. went here for my best friends dirty thirty and truly had a blast; food and portions are amazing for the price and the service was amazing. We had a group of about 13 people and it was not a hassle at all to have everyone together. The music was great and the lighting set the mood. We all enjoyed our food and the company was even better.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.7195093035697937, 0.5256121754646301, 0.11704447865486145, 0.0043272580951452255, 0.002669920912012458]}, {"sequence": "I just celebrated my birthday here last weekend and it was amazing.From the food, to the drinks to the ambiance of this place - everything was perfect!I had about 10+ guests and the server Coral was super friendly and soooo patient. She even split the bills for us which was great!I'm so glad I read and listened to all the other great reviews because the hype is real. Believe it! Can't wait to go back. Also thank you Insomnia for the free birthday shot, much appreciated! xo", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.7999718189239502, 0.7179514169692993, 0.6680640578269958, 0.07843724638223648, 0.07579585164785385]}, {"sequence": "This review pains me a little to write, because I was so excited to try this place after hearing about the incredible reviews about the Vancouver location. The decor and ambience is elegant, and a fancy place that tends to house many business diners. Staff are friendly and helpful, and service is great. I've been here a few times and have tried a variety of items. I tried the Oshi sampler, which was quite good - they have salmon, ebi sushi and saba sushi. The taste is good, and it is well prepared. We also had the Prime Rib which was good, but was very small and not worth the $45 you pay for it. The Miku roll is also consistently good, but nothing groundbreaking for $20. I would say the best value is the Aburi Oishi sushi, as they are well torched and come with a good amount for the price.All in all, Miku is good - don't get me wrong. I think my issue is just the value, as the portions are so small and you can get the same quality and preparation of sushi elsewhere for a much more reasonable price. The food is good, but not amazing, and that tends to hit you when you get the bill at the end of your meal.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.5513139367103577, 0.26273444294929504, 0.16935531795024872, 0.13487555086612701, 0.060320932418107986]}, {"sequence": "The location of the restaurant is very convenient, right at Bay Street and Queens Quay. Easy for both tourist and corporate crowd. We had the famous Aburi Sushi flight, is fantastic. I always love the creativity of these artistic sushi. The combination of the fish, seasoning and garnish gives the tongue an unforgettable experience. For entree, I had the bacon wrapped tenderloin with foie gras. The beef is not very flavorful but it has all sorts of sauce on the dish so it compensate. I always love foie gras so no complain, had better before though. My husband had  Baked Sablefish with lobster tail. Fish is excellent, lobster is ok. Dessert is great, we both had green tea opera. I tried Japanese whiskey for first time, I think I will stick to my Scotch.  Next time to visit, I will focus on sushi only.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.027218258008360863, 0.009883306920528412, 0.0006389455520547926, 0.0006240865332074463, 0.0002094329393003136]}, {"sequence": "Amazing. Some of the BEST sushi I've ever tasted! My friends and I were thoroughly impressed with the food. I love that each piece of sushi is super flavourful and it does not require soy sauce at all - you can tell each piece was carefully thought through and made. The chefs recommend you eat each piece without any soy sauce because they were made to be enjoyed without it. I was literally making sounds after I had each piece of sushi - it's that good. Yes, this place is quite pricey.. but it really is a great place to try, maybe for special occasions or events when you are craving some quality sushi and don't want to get all you can eat. The average price of a dish is probably $18.00 I would say, but a lot of the dishes were made for sharing with friends so definitely come with a party. They also have a lengthy drink menu with some unique cocktails - I very much enjoyed the Miyazaki drinks. I'll definitely be back to try more of the sushi!", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.0722053200006485, 0.0559215322136879, 0.045138005167245865, 0.007508042734116316, 0.004333076532930136]}, {"sequence": "THE EXPERIENCEBeautiful, modern restaurant with lots of seating, specializing in blowtorched sushi (Aburi). The three of us were seated in a huge comfy booth that could probably fit six people. The server was very friendly! Be prepared to spend a lot if you're looking to get full. We split all of the following dishes below and were still pretty hungry afterwards.THE FOODAlbacore Tuna and Wakame Tartare (4/5)- Tasty but nothing special. I think the wakame seaweed flavour was throwing me off a bit.Aburi Beef Carpaccio (5/5) - Really enjoyed the flavours in this one. The quality of meat was great and I loved the wasabi creme fraiche. Aburi Oshi Sushi (5/5)- We tried the blowtorched Salmon and the Waygu Beef. The salmon was very fresh and the Waygu beef was absolutely delicious. Definitely recommend!Miku Roll (2/5)  - Was not a fan. The roll itself was fresh but it felt like something was missing and the overall flavour was bland. JaBistro's version of this roll is definitely better in my opinion.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.5470772981643677, 0.014762663282454014, 0.008491024374961853, 0.006562501657754183, 0.0024150507524609566]}, {"sequence": "I truly enjoyed my experience at Miku - same group as Minami in Vancouver! The sashimi offerings are nice and truly fresh and of high quality. I ordered the Coal Harbour and it had a very nice combination of seafood. The hotate crudo serving was generous. Loved the fresh spot prawns, which by the way, Ki doesn't have.  You could also order half orders which allows you to try more. Most importantly, their wasabi is much better than Ki. Ki offers powdered wasabi! I noticed this difference immediately.Had a wonderful and attentive server, unfortunately, don't have his name. He was not pushy and quite knowledgeable with the menu. Overall, their fish quality is far more superior than Ki. Ki is in a better location hence high volume and much crowded and high energy.  I like the ambiance of Miku much more because Ki can be overwhelming.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.19333931803703308, 0.12275703251361847, 0.056439127773046494, 0.05262449011206627, 0.01636662147939205]}, {"sequence": "The original place we wanted to eat at was closed due to a flood so we opted for GB Hand pulled noodles as our back up. We arrived around 7pm on a Monday and there was only 1 other group in front of us waiting for  a table. The place is small so a wait is expected. I ordered the small Lanzhou Beef Noodle Soup. I found the soup to be quite plain even with the chili oil added but I was very thirsty after I finished my noodles. Perhaps they use a lot of msg. The noodles were not bad and the portion is a good size. The beef was good and not chewy like other places.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.039370350539684296, 0.00879725906997919, 0.0053479913622140884, 0.004654622636735439, 0.002715593669563532]}, {"sequence": "One of my favourite noodle houses in Toronto! If you're looking for a quick place to satisfy your noodlely cravings then GB hand-pulled noodles is the place to visit.I always order either the Special Lanzhou noodles or the Noodles with Homemade Pork Sauce. You really can't go wrong with either. The ingredients are always super fresh and flavourful. There's a decent noodle to toppings ratio and you probably won't have to deal with any bites that are only noodles. Service is prompt you will be expected to have your order ready while you are waiting in line and your food will arrive shortly after you sit down. Most smaller groups will have to share tables so don't expect to have an intimate date here... The price is also decent expect to pay around $15 per person after tax and tip. Overall would definitely recommend for my fellow noodle lovers!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0050291805528104305, 0.003962256480008364, 0.002641271334141493, 0.0026133342180401087, 0.001106600509956479]}, {"sequence": "Medium noodle taste good and chewy. I like it. Little dish is good but small. The broth is good.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.5714884400367737, 0.4427932798862457, 0.02291262149810791, 0.008372721262276173, 0.0024499408900737762]}, {"sequence": "Step 1. Pick your main dish Step 2. Pick the type of noodle you'd like in it HOMEMADE PORK SAUCE DRY NOODLE (5/5) - I chose their narrow thick noodle and loved it's chewiness. The fermented bean sauce  was soooo delicious especially soaked up in the ground pork. The vegetables were basic but well done in order to compliment the flavour-packed sauces.LANZHOU BEEF NOODLE SOUP (3/5) - I got it with their flat medium wide noodle which I found was cooked a little too long since the texture was a lot softer and not as chewy as I'd like. The soup was on the saltier side but it was flavourful. There was a good amount of delicious beef slices. Next time, I'd want to try a thicker noodle with the spicy sauce added to the soup as well!JELLY FISH APPETIZER (3/5) - very crunchy and refreshing, but not too much flavour was associated with it.SPICY LANZHOU BEEF SHIN (4.5/5) - very flavourful, not dry at all, and the spicy sauce complimented it so well with the fresh parsley. $8.99 is very expensive for what it is though.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.2102215439081192, 0.03530876338481903, 0.009225886315107346, 0.004721402656286955, 0.0045451452024281025]}, {"sequence": "Visited GB Hand-pulled Noodles a few days ago. I was very excited to hear that there was a new hand pulled noodle shop in the downtown area. The shop itself is relatively small, but cozy, and you can see the chef pulling the noodles in the front.I ordered the braised beef noodle bowl with medium thick noodles, and the meal arrived very quickly. While the noodles themselves were very good and cooked perfectly, the broth itself lacked depth and was just salty.Menu also lacked diversity; I was hoping for maybe some stir fried noodles, but only soups or dry noodles were available.If you never had hand pulled noodles before, I would recommend. If you have already tried hand pulled noodles, I would recommend other places instead.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.13358859717845917, 0.10128530859947205, 0.06051753833889961, 0.052841585129499435, 0.009992347098886967]}, {"sequence": "Visited for the first time for dinner on a Friday.Pros:- Busy intersection, easily reached via TTC. No free parking and paid green P easily accessible.- Phone reservations highly encouraged. Seats were available when promised.- Good selection of beverages, cocktails and sake- Interior is nicely decorated- Oyster topping sauces had lots of variety - $1 oysters on Tues and Wed.- Friendly and attentive staff- Fried shrimp dish was yummy- Free cheesecake if you're celebrating your birthday (almost every table was celebrating a birthday...)Cons/Improvements:- Was looking for a larger selection of food menus and more authentic Japanese dishes. Most of the dishes were fusion styled and quite overpriced. $20 for a 8 piece roll and $50 for a 30 piece sashimi- Sake menu perhaps can include pictures / Kanji for those who recognize the label or Japanese name. - Bigger portions rather than making customers pay for multiple dishes to accompany their alcohol- Improve quality of sushi and sashimi - they weren't bad, but I was hoping for more luxury varieties like uni or toro for the price I paid.Summary:The ambience is great for a tapas style gathering with friends along with alcoholic beverages (what an izakaya should be) However, if you are looking for authentic Japanese cuisine and dining experience, this may not be the place for you. Our group of 4 ended up grabbing ramen down the street to fill us up.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0896453782916069, 0.0237454641610384, 0.008583872579038143, 0.00744930375367403, 0.00020969915203750134]}, {"sequence": "We visited on a weekday night, so it wasn't too busy. All of the food items we ordered were delicious, and I find their dishes quite unique compared to other Japanese restaurants. The bill really surprised me in the end.. I found it very pricey but it was a good experience overall.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.3220367431640625, 0.006769175175577402, 0.0027204749640077353, 0.001216104137711227, 0.0002794548636302352]}, {"sequence": "Came by with the girls today. Nomé is the best place to go in the area for food or drinks. Tuesday, Wednesday oyster nights are popping. Make sure to book reservations ahead of time to avoid disappointment. They've recently installed a naturalized water that kills bacteria with an ultraviolet light and boy does it taste good! Pay the extra couple dollars for it. Food is great, service is great. Can't complain. My favourites are the lobster fantasy roll, sashimi salad, sliders and the new addition on their featured menu \"smoked scallop roll\" is really tasty. The servers are hot. I love all of them even the owner Pat, which is super good looking as well Rachel is awesome and she's super attentive Come here now if you haven't alreadyNew location coming up soon!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.09088927507400513, 0.036907438188791275, 0.012318919412791729, 0.010538622736930847, 0.002946007763966918]}, {"sequence": "This is one of Toronto's hidden gems in my opinion.  If you like oysters you have to come here.  The prices are reasonable and the service is quick.  The tiger prawns were amazing as well as the unagi risotto...so creamy.  However the best part of dinner was dessert.  How can the honey bread taste that good?!?!?!  I was amazed by it.  I will return!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.06231428682804108, 0.02943360060453415, 0.028593551367521286, 0.01471463032066822, 0.0019707882311195135]}, {"sequence": "Nomé is my ultimate go to when I'm craving for oysters. On Tuesdays and Wednesday they offer $1 oysters! Make sure to make a reservation or you'll be waiting for a bit! I highly enjoy the atmosphere at nomé, music is good, food is amazing and the staff is very attentive. I highly recommend the Japa burgers, their sushi rolls and of course $1 oysters! Friday through to Sunday nomé can get pretty loud, so I do recommend asking for bar seats if you don't want to be yelling across the table.", "labels": ["Italian place with a burger", "A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.19871646165847778, 0.07790257036685944, 0.06191764026880264, 0.0008897465304471552, 8.46053080749698e-05]}, {"sequence": "Overpriced small portions. Style is almost more of a club vibe than a restaurant. I couldnt even taste the Mezcal in my cocktail. Left still hungry and bought a sausage from the street vendor on bathurst. My friend didnt even get her tacos until I was finished eating. The manager apologized and gave us them for free, but overall the experience was terrible. Never going back.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.10788976401090622, 0.01230100728571415, 0.006924706511199474, 0.0036019934341311455, 0.00025380795705132186]}, {"sequence": "This was one of the most disappointing experiences in Toronto. Fellow yelpers let me down as I expected great food based on the reviews. On the plus side, we were seated quickly without reservations on a busy Saturday night - I think that's all I have for the plus side. We ordered the three dips and chips (photo), a variety of tacos, salad, sangria and a margarita. The tacos were decent, nothing to rave about... I am compelled to write this review because the guacamole was basura. The guac had the texture of a vitamix recipe with no evidence of avocado chunks or flavor. It wouldn't bother me if guacamole were terrible anywhere else but this place is clearly Mexican inspired and needs to be renamed if they are going to serve such terrible guac.  The drinks were great so if you do go I'd recommend the bar but make plans for dinner elsewhere.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.15861305594444275, 0.006476214621216059, 0.004556721542030573, 0.0032356970477849245, 0.0011270696995779872]}, {"sequence": "Certainly La Carnita knows how to make delicious tacos. Each taco order comes with one taco so I decided to mix and match and tried a fish one, a chicken one, and a steak one.In Cod We Trust (favourite)The cod was soft, fluffy, and lightly battered on the outside. It also comes with \"Voltron sauce\" which is La Carnita's secret sauce named after a cartoon super robot lol. It uses \"tamari\" soy sauce as the base and I felt that it paired well with the cod. The extra cabbage, green apple, and cilantro on top complemented well with the fluffy cod by adding some crunch to it.Pollo Frito (almost tied with steak but I ranked this as my second favourite because it was slightly sweeter from the honey)  Crispy chicken thigh, peanut mole,honey, Rossy's hot sauce, green cabbage & salsa frescaThe chicken was nice and sweet and also tender and slightly crispy on the outside. If you like sweet stuff definitely try the pollo. Beware though that while the chicken is sweet some parts of the taco can also be spicier than expected from hot sauce.Carne Asada - Grilled Beef Steak, chipotle mayo, Tomatillo salsa, Lime Avocado, Crispy Shallots & cilantro. The steak was good but the salsa and mayo were a little too spicy (tasted like spicy mayo but stronger). For tacos I preferred the chicken and fish because of the lighter texture to go with the delicate tortillaFor starters we tried the ancho bbq wing but in comparison to the tacos they were more dry and somewhat small. I probably won't order the wings again but definitely try out these tacos!!Seating can be crammed but all in all great casual lively atmosphere with dim lighting; and flavourful tacos that come with a good amount of toppings.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.35339176654815674, 0.018112709745764732, 0.012675405479967594, 0.009344895370304585, 0.00139506661798805]}, {"sequence": "I've been here twice (once in May 2014 and more recently on November 3rd 2017) and the John St. location a few times.The first time I went to this location was back when La Carnita only had one location on College Street.  And it was LOUD.  I couldn't really have any conversations with my friends because it was so packed and the music was loud -- basically had to shout the conversations even though my friends sat pretty close.I'm guessing that, due to expansions, the College Street location isn't as packed as it was back when they first started out.  Came here on a Friday night close to 6:00pm after catching a movie in the afternoon and it was about 60% full.  Waitresses and waiters were attentive and the food came out pretty quickly, so it was good.  The restaurant did progressively get more busy as the night went on, but I think my friend and I arrived just before the dinner rush.Ordered a lot of classic tacos and I ended up getting churros for dessert.  Food is just as good as the John St. location and the same as I remember, so I'm definitely coming back!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.14592044055461884, 0.09216565638780594, 0.04226079210639, 0.035586364567279816, 0.021430635824799538]}, {"sequence": "Simply not good food... Tasted like the salad came directly out of the fridge and my taco was just spicy - no flavour. Didn't feel like any love was put into the food.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.4413253664970398, 0.19614708423614502, 0.002833606908097863, 0.0020959919784218073, 0.0015453173546120524]}, {"sequence": "My family went to the Pearl Diver this week. We were staying at the Holiday inn express which is a very short walk. We went 2 nights in a row because we loved it. We had oysters both times which was fresh and delicious.The second night we had fish and chips also. They came with a homemade apple coleslaw and tartar sauce.Definitely will be back the next time I am in Toronto.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.007047285791486502, 0.0020305446814745665, 0.0015247990377247334, 0.0009104304481297731, 0.0007505412795580924]}, {"sequence": "Very nice place for a get together with a group of friends. We were a party of 5, and the table reserved for us was at the back of the restaurant where the music was a little quieter and cozy.. and we had more privacy which I appreciated. We were here on a Thursday night at about 8:30, the restaurant was not that busy but it would still be a good idea to make reservation if you come with a bigger group.  We got the Thursday special, 100 for 100 malpeques, coconut mussels, chicken liver & oyster pate, calamari, fish & chips and a grilled sea bream. I was most impressed with the calamari, chicken liver & oyster pate, and fish & chips. Everything else was good but they did not wow me. They had a good selection of drinks, but they were pretty pricey. In terms of service, the waiters were knowledgeable and attentive, they made sure that our water was filled, checked in with us a few times during our meal, and refilled our toasts for the pate.  I would definitely come back to try other oysters!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.1200966164469719, 0.03632787615060806, 0.034178439527750015, 0.031377509236335754, 0.029994891956448555]}, {"sequence": "Was in the mood for some shellfish and so decided to give Pearl Diver a try. Quite a small spot so was lucky to get in during the dinner hour. Cozy atmosphere with friendly and knowledgeable wait staff.To start I had the zinc and drink special with Malpeque and Savage blonde oysters and a Trailhead lager. For my main I had the coconut mussels with focaccia. The mussels were a nice size and the coconut broth with chilies, lemongrass, ginger, and garlic was amazing. Finished off the meal with an espresso. Excellent!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.8128609657287598, 0.00047085012192837894, 0.00038119484088383615, 0.00023487809812650084, 8.615435945102945e-05]}, {"sequence": "Sooooo...came on the oyster night, but didn't get the oysters (which are probably the biggest draw for this place). The first thing I noticed was the restaurant is WARM. It was a very warm day in the city, and walking into the restaurant, I was praying for the sweet embrace of AC, but was greeted by more stuffy warmth. It's a quaint spot, and service is alright, albeit detached and needed to be prompted (we had to ask for water on several occasions). We ordered the oyster and chicken pate (this was good, though I think I prefer classic pate). We ordered the sardines (SOOOOO MANY BONES), the mussels (these were actually delicious, in a coconut curry sauce + fries were shoestring fries that were well fried), the calamari (this was interesting with a super crispy coat, but was very batter coating heavy, with little squid), and the fish and chips (same fries which were good, batter is very thin and overly oily, with a strong fishy taste....there is definitely better in the city!) Drinks are quite pricey, so not the best place to drink, but beers on tap have specials, and they have 7$ glasses of house wine. It didn't live up to the hype at all, but if you're looking for oysters, then I imagine it's the place to be!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.10271735489368439, 0.009741275571286678, 0.00651781540364027, 0.005722283851355314, 0.00179099861998111]}, {"sequence": "We came for brunch on a sat.  The restaurant was quite empty.  Service was not bad, however the food was a bit lacking. The pearly chowder was a bit watery!!!  The oyster Benny was ok, the salad had a lot of dressing.  Shrimp po boy was ok....The worst was the home fries.  It's not crispy and with too much ketchup-a-like sauce.  What pisses me off was the other table had the same benny but came with fries!!  The fries definitely looked much better but we did not know we could change to fries....nor we were asked.Parking around here is expensive (green P parking was $5 an hour).  Don't think I would come back again.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.22294743359088898, 0.06657871603965759, 0.038654036819934845, 0.014596579596400261, 0.0028990190476179123]}, {"sequence": "We went to Gusto101 for a friend's birthday and I can see why Sophie Trudeau and Michelle Obama chilled there too. The ambiance was really nice at night with low lighting. The server we had was friendly and helpful. The food was just superb! We all got pasta and I got the Mafalde ai Funghi which was recommended to me by friend and I'm so glad I did. This may be the best pasta dish I've eat had - and I've never been the hugest fan of mushrooms! The portion size also exceeded my expectations and I ended up even packing it (and I eat a lot so...lol). Would highly recommend to anyone! Afterwards I kept getting the same dish delivered and once added tried their burger on a whim. Is everything on their menu just amazing?!! The burger was cooked to perfection and tasted so succulent and delicious. Can't wait to go back/order the dishes again!", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.9286616444587708, 0.24016356468200684, 0.23657937347888947, 0.05831371992826462, 0.018947595730423927]}, {"sequence": "This restaurant is a nice place to drink and socialize, but not great to eat (more on this below). Outdoor patio is great but fills up fast so come early to get a table. The interior has a warehouse feel with concrete construction, high ceilings and large windows for a lot of light. The downside was the food... some of the dishes were great but some were very mediocre. My favorite dishes were the scallops and arugula salad. The octopus was overcooked and the texture/flavor was not great. Also the mushroom pasta was bland.Another con is that the food took FOREVER to arrive. It took so long that we actually had to leave almost as soon as the food arrived so were in a rush to finish our food. The waitress apologized for the delay but it made for a less than stellar dinner experience.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea"], "scores": [0.5535383224487305, 0.1215396299958229, 0.06714976578950882, 0.013336854986846447, 0.0012676804326474667]}, {"sequence": "I had a good time here!The restaurant is super cool and trendy, and the food is really good!I came here on a Friday night with a group of 5 people and we had a reservation for 6:30. It wasn't super busy but by the time we left it had really filled out and had a lineup out the door. The restaurant is dimly lit and has a really cool industrial look to it. We were sat upstairs and am told that the roof opens up in the warmer months to make a giant outdoor patio, I'd love to come back in the summer to check that out. Our server was pretty attentive, they were nice about giving us extra time to select drinks and food and we didn't feel rushed at all. A few times the food came to the table and was given to the wrong person but it wasn't a big deal. For the food, I ordered the kale salad, I liked it, I found it a bit salty with all the cheese, but I liked the pine nuts and currants for texture, it was also a very large salad, I think it could be easily shared as a side for two people. I ordered the cacio e pepe pasta which was really good. The noodles were cooked perfectly and I really liked the taste of the sauce and the pepper. It looked like a small portion but it ended up being quite rich and salty and I actually had a hard time finishing it. I'm not a fan of mushrooms but a few people had the mushroom mafalde pasta and enjoyed it, they also loved the mushroom bruschetta. Lastly, I tried a piece of the steak and it was good, cooked perfectly and nicely seasoned, it wasn't outstanding but definitely solid. I liked the sourdough bread too, although I think it was a bit pricey for bread, which is often free at other restaurants. I didn't order wine but it's $1 per ounce which is a great deal. Overall this is a really cool place and the menu is pretty extensive so I think everyone could find something suitable. Prices are not outrageous, I think they're appropriate for the food quality and portion. I would definitely come back to maybe try one of their specials, unfortunately lasagna was on special for a different day, and also to experience the open roof in the summer!", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.2164459526538849, 0.1273672878742218, 0.1058889776468277, 0.050766266882419586, 0.01965639367699623]}, {"sequence": "amazing. simple. good food and vibe.  trendy. check it out. 100% endorsement lots of good choices for those that want variety", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.48059308528900146, 0.47901901602745056, 0.31297630071640015, 0.0995696634054184, 0.02927946299314499]}, {"sequence": "I loved the setting and layout of the restaurant! It's located in the heart of downtown.It was a sunny afternoon and we were celebrating my boyfriend's birthday. If you'd like to sit outside on the patio, I recommend making reservations and bringing sunglasses! Our waitress was kind and helpful when it came to asking for a dessert and candle for my boyfriend (not complimentary - you do have to pay for it). It was a success and he was definitely surprised! However, the service was quite slow for brunch and perhaps that was due to the busy hour. I wasn't too bothered by it, as were some people.I ordered a Berry bowl because I was feeling 'fruity', however I wasn't too happy with the overall taste of it. It was more on the sour side and I prefer sweet - plus the yogurt was actual warm rather than cold. I've never had warm yogurt served as part of a berry bowl. Don't get me wrong, I still ate it but it wasn't the best. Probably WOULDN'T recommend that order. Although, my boyfriend ordered the Gusto burger and he found it to be flavourful and well cooked, so based on how happy he was with his meal I'd recommend it too! Lastly, I had to top off our brunch date with a Sangria and I have no complaints about it. Tasted just perfect. Overall I'd say Gusto 101 is a nice spot to catch up with friends or have a one on one date. Bound to have a good time here!", "labels": ["Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.72173011302948, 0.1329568475484848, 0.06392564624547958, 0.03800325468182564, 0.020362503826618195]}, {"sequence": "Once you go Konjiki, you can't go back. Seriously, the best ramen you can have in Toronto. Michelin recommended and this is one spot you don't want to miss out on ;)It gets better each time I visit but I always go for the Tofu nuggets! They are crispy on the outside, hot and soft on the inside. Definitely a must order!The following are my favourite ramen bowls at Konjiki, starting with my TOP FAVOURITE:1. Smoky Black Tonkotsu Ramen - Best. Ramen. Ever. If you love smokiness in everything (in food, cocktails, weed LMAO just kidding), you will love this one. Highly recommend. #一試難忘2. Vegetarian Ramen with Creamy Potato Soy Milk Broth - Hella yass. This one is so creamy good; I wanted to drink all the broth lol. Though it is vegetarian, I added braised pork belly (+$3) for my meat-lover self lol.3. Signature Clam Broth Ramen (Shio) - Definitely a classic at Konjiki. If you have never had calm broth before, this will blow yo' mind! It is actually very light compared to the usual chicken- or pork-based.I have yet to try the ramen with lobster broth! It seems like they only have it on Wednesdays! Gotta make time for thissss... till next time :)P.S. I'm not sure if you would still have room for dessert but Saryo Cafe & Dessert shares the same unit as Konjiki in the front of the restaurant. Check them out for some matcha soft serve and delicious cakes!", "labels": ["Japanese restaurant with pasta", "An ice cream shop with bubble tea", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.37855252623558044, 0.13827481865882874, 0.06973254680633545, 0.03919543698430061, 0.01326476689428091]}, {"sequence": "Pros: Very good bowl of ramenOne of the best karaage in a ramen restaurantCons:No extra noodle optionNot too much seatingTook me long enough, but I finally got a chance to try this place.  This is a Michelin recommended ramen and it doesn't disappoint.  It will be one of the better ramens you have here in Toronto.Konjiki is on the smaller side for a ramen restaurant.  They have a large table in the middle best suited for singles coming in.  There are about 5 tables for 2's and 2 tables for 4.  Needless to say, this isn't a place for large groups.  They could sit a large group in the middle table but it's not the most ideal as you won't be able to see/talk to certain people in the group and/or you could be seated with strangers as well.OK, on to the most important part, the ramen!!  Konjiki's ramen is some of the best you will have in the city.  Their menu is simple but what they do, they do well.  You have 2 signature clam broth ramen, 3 tonkotsu ramen, and a veggie ramen.  There's a lobster ramen on Wednesday that replaces the 3 tonkotsu ramen.  We ordered a clam ramen and a tonkotsu ramen with a side karaage.As I said, the ramen here is one of the best you can get in Toronto.  The broth here is super rich and very tasty. I had the smoky black tonkotsu and it was amazing.  You can really taste the quality and time put in to the broth which is the most important part of ramen for me.  The noodles were very good as well.  Ramen noodles should be served aldente so there's some bite to it.  Konjiki does an excellent job of this.  The karaage is probably the best I've ever had at a ramen restaurant.  When a restaurant puts that much effort into it's side dishes, you know that's a great thing!I have but one beef with his place but unfortunately it's a big one for me.  I'm a big eater and I can eat a ton of noodles in one sitting.  I always get extra noodles when I have ramen.  This place doesn't have that option.  If I want extra noodles I have to get another bowl which is another $15, not happening.  It's the only ramen place I've been to that doesn't offer this option.  This place would easily be a 5 star if not for this.No extra noodle option withstanding, this place is a must try for all ramen lovers.  For bigger eaters like me, you might want to have a snack before or after.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.5686894655227661, 0.39345547556877136, 0.23142708837985992, 0.2171756625175476, 0.01699318364262581]}, {"sequence": "There used to be a line up here when they first opened. Now there's no line ups at all! Because it received a Michelin star In another country I wanted to try this place out. Their broths are definitely different than your regular broth. I've been here maybe about 3-4 times now and I keep going to see maybe if the flavours have changed and it has! When they had line ups the broths were not d flavourful maybe because they had to rush and make orders since there were more people.I'm not so fond of their noodles either because it doesn't seem as authentic. They are straight noodles but the one I had was a bit hard for my liking. The pricing here is average. It could go a little cheaper based on what I'm getting. I'd only really come back here if I am in desperate need of ramen or sansotei was closed XD", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea"], "scores": [0.2511836290359497, 0.1829330176115036, 0.020060371607542038, 0.018850719556212425, 0.0038269071374088526]}, {"sequence": "It's taken me a week to process my experience and finally come up with a rating. Despite some negatives, I'm giving Konjiki 4-stars. We came here on a Sunday night, looking for a warm & quick meal. Konjiki fit both categories. To my surprise, we were seated immediately at the communal table which fits about 20 people. There are only several tables on the perimeter of the restaurant that provide some privacy. Nevertheless, right after we were seated (around 6:00 pm) a lineup started forming in the entryway. We ordered the Asahi Dry Black Beer ($8.00), Smoky Black Tonkotsu Ramen (13.00), and the Intense Shoyu Clam Broth Ramen ($14.00). The drinks came immediately, whereas the ramen took another 10 minutes to arrive. The service is quick, pleasant and efficient--no complaints there. The food, however, has some inconsistencies. The Smoky Black Tonkotsu Ramen was overpowering in flavour. When I eat ramen, I make sure to finish my broth. This, however, wasn't one of those instances. The intensity of the flavour came from the fat content in the broth & the amount of salt.The smokiness only came through in the cherry tomatoes (surprisingly). The Clam Broth Ramen was good, but I had the opposite issue with the broth--it was underwhelming. There simply wasn't enough seafood flavour. The portions are also fairly small for the price. Conclusion? I'm in love with the creativity that goes into the ramen, as well as the selection of unique flavours. Would I return? Perhaps, but Konjiki is not my favourite ramen spot in the neighbourhood.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.26345813274383545, 0.2621554434299469, 0.0947585254907608, 0.046052444726228714, 0.0185147263109684]}, {"sequence": "I came here with 2 other friends to try Konjiki's lobster ramen on a Wednesday. We all ordered the same thing, lobster ramen + tamago (egg).The ramen had a generous portion of well cooked (e.g. not chewy) lobster meat. The lobster had a hint of sweetness to it. I also like how they added a small amount of lobster roe? the orange-yellow paste on top of the lobster. Some people might find it a bit fishy, but to me it was the essence! The broth, on the other hand, fell short of my expectations. The broth had a promising orange-red colour, which suggested they simmered the lobster shells. However, all 3 of us agreed that we could not taste any component of seafood in the broth. I was glad I added the egg. It was not salty like many ramen restaurants. And despite eating the egg approximately half way through my ramen, the yolk was still 50% runny!The appearance of the sous vide cha siu reminded me of sliced ham from the deli counter. So my expectations for it was set quite low. However, after taking a few bites, I actually quite enjoyed it. Despite it's \"smooth\" looking appearance, there was still the texture of meat. The ramen noodles were alright, not too memorable. I don't see myself getting the lobster ramen again, it's more of a \"tried it once and it's sufficient\" type of dish. But I will come back to try their clam broth ramen!", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.40893101692199707, 0.15572358667850494, 0.04973229393362999, 0.03786671534180641, 0.010521646589040756]}, {"sequence": "THE BEST BRUNCH!! Lots of vegetarian options which is always appreciated. We split the A.M. Poutine and Moroccan Scramble, and both were out-of-this-world good. The wait was about 30 min for a party of 2 at 10:30 am, but well worth it! I can't recommend Lady Marmalade highly enough.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.04861867055296898, 0.00033190357498824596, 0.00021413908689282835, 0.00019764978787861764, 0.00015890733629930764]}, {"sequence": "In the picture (3 scrambled or poached eggs topped with cheese,chillies&salsa.Guacamole&black beans with Tortilla(made in house)You can get to the restaurant by streetcar on Broadview as sometimes it's a bit difficult to find parking. The atmosphere is quite casual and a bit tight but very clean and bright.Staff was very friendly and they know the menu very well.As any good restaurant, quality here is superb, I so loved the eggs, the guacamole and the fries it was all made perfectly with a good quality ingredients.There is two floors of the restaurant so u can still go to the top floor if the bottom one is fully occupied.I strongly recommend this restaurant for a brunch.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.01727697066962719, 0.0003814006340689957, 0.0003698126529343426, 0.00016890079132281244, 7.502920925617218e-05]}, {"sequence": "Lady Marmalade is that rare place in Toronto: it's good, and it's consistently good without any particular gimmicks or exorbitant prices. Heuvos Migos and Conchita pibli eggs Benedict are both excellent. The new space is bigger, airy and bright, and instead of a lineup they actually take names now. If there's one tiny complaint it's that a minuscule glass of orange juice that you might finish in one gulp is $4. Feels a bit unfair. Otherwise excellent.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.4147258996963501, 0.02850434184074402, 0.024580251425504684, 0.019153283908963203, 0.003949298523366451]}, {"sequence": "CLOSED, moved location to Broadview and Dundas. It is now 2 floors but still busy and as always there is a wait for a table.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.07495179772377014, 0.019298681989312172, 0.016979340463876724, 0.012452795170247555, 0.0009274473413825035]}, {"sequence": "Come Early! My friend and I arrived at around 9am on a Saturday and there was already a line out the door. We waited around 25 minutes before we were seated. We didn't try anything sweet, nothing really caught my eye on the sweet side. We order 2 Eggs Benny - One was the Bacon, Cheddar and Mango Salsa Benny, the other was the Pulled Pork Benny. Eggs Benny dishes come with salad and home fries (big fan of the salad dressing). WOW.... Both were absolutely delicious. The combination of the Mango Salsa and Bacon was amazing. I would have a really hard time deciding between the two, as the pulled pork one was also amazing. The eggs were cooked to perfection and the most important thing was the feeling after, I was satisfied without feeling gross. I would definitely come back here, but it would be a lot earlier. Keep Eating, Angela", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.2457210123538971, 0.01704530231654644, 0.01216899510473013, 0.010263893753290176, 0.00570594472810626]}, {"sequence": "This homey, gem of a restaurant features delicious and well-made Egyptian dishes. Came here with a friend, and it was or first time trying Egyptian cuisine. We ordered: the Egyptian falafel, Shakshuka and Maha's Mind Blowing Chicken sandwich. The falafel surprised us-- inside there's a soft egg, (you've never tried egg in this form before and need it in your life); my personal favourite! We were greatly satisfied with what we ordered and plan on coming again in the near future to try other dishes from the menu.Staff is super friendly and helpful as well. Highly recommend!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.004343309905380011, 0.0033479994162917137, 0.0006018418935127556, 0.00020307210797909647, 0.00019319563580211252]}, {"sequence": "I've been wanting to visit Maha's for quite some time. Having finally moved back to the GTA, I said it's time. We came for lunch on a weekday and there was a bit of a wait. The restaurant is quite small, but the turnover was quite good. I really appreciated that they put a bench outside for those waiting. Once in, I knew exactly what I wanted to order, given that I've studied their menu and yelp reviews beforehand. We decided to get the Cairo classic, the chicken sandwich, falafel app, eggplant appetizer and their honey cardamom latte. We were 3 and found that to be plenty of food.Let me say that these are THE BEST falafels I've ever had and I've had plenty. The sauce that's given, which is a spicy tahini mix was to die for. The eggplant appetizer was delicious as well. Eating it with their homemade pita bread...oh my I'm salivating. The Cairo classic and chicken sandwich were also very good. I thought the chicken was a bit too saucy and it was hard to taste the chicken. The foul was very good, but I wish there was mooooore!! Finally, the latte was superb. I could have had it all day. Side note, they serve cold water in these cute clay pots that keep the water nice and cold. The service was great and the food was authentic. I will definitely come back again to try something else.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.4488750696182251, 0.10612563043832779, 0.029396316036581993, 0.02554306387901306, 0.02151043340563774]}, {"sequence": "After hearing so many mixed reviews about this restaurant, I had to try it myself. Upon arrival, we had to wait about 40 minutes, which I heard isn't bad! People I know that have been here said they waited around 1-2 hours. The weather wasn't bad, so we didn't mind at all.The restaurant itself is super small! There's hardly any seating inside (I mean there is, but it's not spacious as most restaurants), however they do have a patio. The staff here seemed nice. Our waitress was really kind, however the service was a bit slow.The food was AMAZING! True, authentic Egyptian food. I had Maha's Mind Blowing Chicken and wow it was so good. I've never had anything like that. The portions are huge, which is a plus because it isn't expensive. The only downfall is that you have to wait SO long to receive the food! We waited nearly 45 minutes just to receive one dish, which was disappointing.All in all, I definitely recommend this place if you want Egyptian food!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.09561938792467117, 0.02025841921567917, 0.006020522676408291, 0.002215856919065118, 0.0001687366602709517]}, {"sequence": "A few of my friends were eager to try Maha's and I'm always down to try something new, however I was a bit disappointed. Service was okay, received our food on time but the waitress was a bit rude, and she disappeared for awhile. Moving on to the food, I tried the Shrimp Poboy and the Mind Blowing Chicken Sandwich. I did not enjoy the Shrimp, it was crispy and well cooked but there wasn't any flavor to it. The sauce on top was Tahini and it was very average. Moving on to the staple, the Chicken sandwich was okay. The bread was nicely buttered but in terms of an actual dish, I wasn't too impressed. There was flavor from the base which I believe is a foul (middle eastern breakfast dish) and all topped with more tahini. I wasn't too impressed and won't be coming back. Keep Eating, Angela", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.17884111404418945, 0.07419031858444214, 0.00531731266528368, 0.003491792129352689, 0.0008981850114651024]}, {"sequence": "Really enjoyed the food here! Local, authentic, heartwarming, family owned, hidden gem! Ordered the mindblowing chicken, cairo classic and kebda eskanderany for mains. And the lentil soup, honey cardamom and cappuccino for starters. The honey cardamom tasted like coffee with a hint of spice. Lentil soup was amazing, light and creamy (I believe vegan as well). All the dishes were different and fresh. Would definitely drop by again! Portions were more than filling for one person. Price was average about $15 per meal. Our bill came to about $90 for three people. Staff were really nice and friendly! Thank you for the spectacular experience!The max capacity is 24 people though. So be prepared for the wait. Arrived at 10:30 and was seated at 11:15.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.11515574157238007, 0.06761745363473892, 0.0027371349278837442, 0.0022316740360111, 0.0006509925588034093]}, {"sequence": "I was over hyped about the chicken and waffles after seeing some of the delicious photos but after tasting the food it didn't live up to the expectations.I ordered the duck taco appetizer which was a good fusion of western and eastern foods. I enjoyed the taco but just wish the duck was warmed up before being placed on the dish.For the main course I got, what I mentioned above, the chicken and waffles. At first sight, I was felt pretty good about the way the dish was plated. It looked pretty just like the photos. The fried chicken was the main selling part of this dish, it was seasoned, juicy and crispy. The chicken is seasoned with a bit of ginger which I think elevated the taste of the heavy dish. But the waffles was a huge disappointment to me. It was soggy and had this weird texture to it. It tasted like something too healthy to be together with the awesome tasting fried chicken. The syrup for the waffles tastes good too.If they can fix the waffles then this will be a five star dish.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.40718746185302734, 0.23643669486045837, 0.014858250506222248, 0.012323485687375069, 0.008755175396800041]}, {"sequence": "Today is Valentine's Day 2018.  Though not a romantic at heart, I've decided to write some reviews today.  Particularly, spots that I view as probably the hot bed of activities on Valentines.If by chance you are a hapless romantic and should you be reading this today, you're probably out of luck!  Most places would have overbooked-itis.  Some might say I should have written this sooner but that would defeat this as a Valentine's day 2018 review.  Catch 22 my friends.Inspire seems to be a very popular place for many.  I have been meaning to go for years, but it's a little out of the way for me.  From what I know, Chef John Hoy Ouk (from my days at Marlowe) opened it and I wanted to try it.From day one, the reviews have flooded in, as their Chicken and Waffles, Inspire Burger, Duck Confit Fries, Udon Carbonara, and other clever menu items, garnered excellent write ups.Having an evening free and coming back from the east end of town, I decided I must try this place.  I was recommended to get a reservation.  I did, and for those who didn't - the restaurant was not that busy at 6PM.  You can guess that on a Tuesday night with bargain movie dating that they won't fill up until about 7PM onwards.Dinner was Chicken and Waffles, Inspire Burger, and some wine.  I had a small piece of the chicken and it was ridiculously infused with sweet flavours but remained crispy.  The Burger was piled high and I had to deconstruct it a bit to make it worth eating without embarrassing oneself.  Really messy to eat, but packed with flavours.  Both dishes are a large size so I would encourage sharing of the meals.  Perhaps some of you will have a \"Lady and a Tramp\" moment with the Udon!The restaurant is small and cozy.  Decor is nice and a pleasant place to have a meal - whatever the occasion.  Plenty of parking in the lot - depending on what time you get there.Watch for the hours of operations.  If you are coming for dinner, expect the doors to remain locked until 6PM.  That was a bit of an unexpected lack in customer service, as people waited outside in the cold.  I was entertained by watching and listening to the cooks who were \"smokin'something\" at the side of the building.Cheers!", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.28501367568969727, 0.1655302494764328, 0.06152844801545143, 0.022234367206692696, 0.0031515639275312424]}, {"sequence": "Huuugeee Disappointment :(#upsetstomach #foodpoisoning #diarrhea #barffff #everythinghurtsandifeellikeimdyingReading the reviews left high expectations for a fancy fusion restaurant on the higher end of the industry, which is why i decided to dine here to celebrate my friend's birthday.I felt so ignored for the first 30 mins of my dinner. I was so hungry too, but it felt like they looked at me a bunch of times, but didn't want to take my order. After ordering, it took 45 mins for my food to arrive. I was starved. :(I ordered a mango berry drink to start and the black bowl edition of the udon carbonara as my main.The drink tastes like mango syrup and they decided to use a coffee stir for a straw so evry other sip had a berry seed clog the coffee stir. The main almost killed me, pretty sure this dish warrants SALMONELLA. The salmon is completely raw in the centre which is not how torched salmon is prepared, it's how incurable infection happens. The clams still have sand in them. The sauce is actually quite good but also quite heavy for the udon pairing. Then you have random pieces of meat here and there, overcooked steak bits and mushy Italian sausage bits. I highly don't recommend to anyone with taste buds, which is a majority of the human population.WORST OF ALL, IT'S SO FREAKING DARK IN HERE THAT I CAN'T SEE WHAT I'M EATING!! smh :(My friend had a bland coffee-less tasting latte to start. She ordered the chicken and waffles. We have no idea why there's a freaking lamb bone just sitting on the side of her plate... like wth. The chicken is ok, odd that it sits the sweeter side for fried chicken. The waffles are mushy and terrible. Maple syrup is drizzled over the entire thing and successfully overpowers everything. Gross.I paid $70 for this and didn't even digest it cuz everything hurt too much and I didn't want to die. :( It wasn't just me, my friend had tummy aches too. Spare yourself and your loved ones the torture and go somewhere else. This is my kind warning.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.36029472947120667, 0.15007852017879486, 0.11728691309690475, 0.04695126414299011, 0.03931208327412605]}, {"sequence": "This is my second dining experience here. I held off on the review until this visit because my first experience was only fair. So in conclusion. I feel It's good. But it isn't as amazing as some of the reviews on here. Price point is fair. Service is sub par. Food flavors were decent. I ordered the duck tacos it plate had 2. Now as I understand tacos in general are never really cheap. I wasn't quite full and I didn't feel it was that amazing. I will update this review upon my next visit.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.5046415328979492, 0.03816656768321991, 0.006230527069419622, 0.00407434394583106, 0.0020506838336586952]}, {"sequence": "I'm always trying to find brunch spots around Markham, but I have to say that Inspire is still one of the best in the city.Small little restaurant in Main St Markham but always full of people. The best is definitely their chicken and waffles as you get the fluffiness from the waffles with a hint of sweet while getting a textural difference of crispness from the fried chicken. The sweet and savory is balanced really well, so if that's your cup of tea you definitely need to try it.I also had their waffles with pulled pork. Great dish but I think I prefer the chicken as the pulled pork was very saucy (yet delicious) but a bit heavy for me so I would want to take a break from it.Would definitely come back to try the other things on the menu. My friends all enjoyed their dishes but we agree that the chicken and waffles are the best!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.11305125802755356, 0.009004779160022736, 0.006181878969073296, 0.005101907532662153, 0.00478872936218977]}, {"sequence": "Authentic Thai food! Came here for dinner recently around 8:30PM- unfortunately two of the food we were interested in were out of stock for the day. Otherwise our alternative orders were still just as delicious. Definitely try their Thai Iced Tea. We ordered: fried garlic shrimp (big? delicious and juicy shrimps); khao soi with chicken (always a favourite) and the pad gra prao. I've heard great things about their pad Thai so I definitely need to try that next time.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.018287131562829018, 0.0001806034124456346, 0.00011779383203247562, 6.978792953304946e-05, 2.8966369427507743e-05]}, {"sequence": "The pad Thai was really really good and very flavorful but the large noodles in the pad see ew were a bit tasteless compared to the pad Thai that my husband had gotten. I was super excited to try this place and although my husband loved his food I was a bit disappointed. I think I would come back just to get the pad Thai though that was really good. I had no idea how tiny this place was and how easily it could've been missed but lesson learned. I came on a Tuesday afternoon at 2 PM and was happy to get seated immediately!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.11593864113092422, 0.04551157355308533, 0.026150617748498917, 0.002030626405030489, 0.0008407706045545638]}, {"sequence": "I've been to this location once and basing the review on this experience as I used to go to the old location before the move. Food is good but a little pricey for the portions but it is expected given the location lol. They satisfied my pad see ew craving that I've having since Miami (best pad see ew I had was in Miami... Little Havana) thai iced tea was strong and Tom yum was authentic! Service is attentive but due consider that they're very busy most operating hours, I don't believe they take reservations so be prepared to wait a little. They offer to wait upstairs at their bar and grab a drink which you can bring downstairs if you don't finish it. The set up they have is narrow and if you're coupled up there's a possibly that you're sitting next to another party. Doesn't bother me as I rather not wait for a table.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.24522122740745544, 0.17833887040615082, 0.061394184827804565, 0.0082375044003129, 0.007180110551416874]}, {"sequence": "Pros: good foodCons: loooooooooooooooong waiting time. It took me half hour wait time to secure a seat and another 40 minutes for food to be served.Not recommended. Should just go to nearby Pai Thai restaurant.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.12787246704101562, 0.05414341390132904, 0.05264316499233246, 0.013353034853935242, 0.0014796750620007515]}, {"sequence": "My friend and I had both wanted to try this place for a long time, so we came here last night. We arrived at around 5:45/6 and were seated immediately - no wait. However, when we left at around 7, the lineup was almost out the door. So come early if you can!The restaurant is located on a quiet, not so busy street which is nice, and the atmosphere inside is pretty laid back. We sat downstairs but they have some upstairs seating as well.The service was fast and friendly, our orders were taken within minutes and the water refills were instant - which is a big deal for me!The food itself was great. I had the pad gra prow and my friend had the green curry. The pad gra prow is becoming my go to dish at Thai restaurants and this one was amazing. There is a large portion of meat (I got the ground pork), and the flavour is really good. We both also liked the green curry a lot because it seemed a bit lighter than most other places' green curries, but still had the same great taste.This will definitely become one of my go to restaurants downtown!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.11996054649353027, 0.04985405132174492, 0.016860485076904297, 0.009212043136358261, 0.002372442279011011]}, {"sequence": "We came here on a Friday night and the place was filled but not too packed. We were seated right away next to the kitchen and we watched the servers do their thing the entire night. The restaurant is beautiful and spacious - perfect date spot! I do recommend dressing up a little if you can. We ordered the bacon wrapped dates, the selection charcuterie plate, and a large scallop paella. This was more than enough for two people. The scallop paella was amazing - each bite was incredibly flavourful (and the scallops were huge!). Also, shoutout to our wonderful waitress who kept checking up on us!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.02458242140710354, 0.00991667341440916, 0.005346222314983606, 0.0051562110893428326, 0.001091585960239172]}, {"sequence": "Came in on a Wednesday night and it was packed (reservations are probably a good bet). Ordered a few appetizers, cocktails and two Paellas. Overall I had a great experience. Service was prompt with regular checkups and water refills. Our food arrived in a timely fashion. Seating was a bit tight, but I think they are trying to mimic an European style layout. Overall on the pricey side.We ordered the Paella Patria and Paella de Carrilada. Both were fantastic but very different. The Patria was very traditional seafood dish while the other one was quite unique and had more intense flavours. All our apps were server recommendations so I don't remember their names but were all fantastic. Definitely recommend asking for the popular dishes.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.17128723859786987, 0.009288945235311985, 0.009041398763656616, 0.006606199778616428, 0.004513516090810299]}, {"sequence": "This spot!  Like MC Hammer, lemme BREAK IT DOWN.  Just come here.  JUST.  COME.  The clientele is so cool, so hip, so well dressed so...  In the words of Paris Hilton, 'Hot.'  These dishes are just AMAZING.  I came here with my boss (cool guy) but he is a Vegan (zzzzzzzzzzzz).  The Staff were so accomodating and helpful to him but the meat dishes here are where it's at!  I SEE YOU CRACKLIN' PORK!!!  Sorry I dissed on Vegans.  Shishito Peppers too.  So...  As they say in E-th-paña - MUY BIEN!  Just come.  Staff awesome too.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.49555131793022156, 0.26335132122039795, 0.11809922009706497, 0.10869260877370834, 0.010284071788191795]}, {"sequence": "My favourite thing about this place is the high ceiling which the large paintings which set a really atmosphere atmosphere. Hosts also asked to hang our jackets when as walk in. Came here with 3 girlfriends and we ordered a sangria to start - which to be honest wasn't that great. Then we had a bottle from the beverage menu which was quite extensive. Ordered a couple Paella which is there shared dishes and they were all delicious - the braised beef being the best. I also ordered the chicken from the main course which was cooked with a sweet sauce served with pecans on top - was really good. Place is great, menu is more on the pricier side. So I'd say ideal for a nice date dinner I'd say or business dinner as it's a little more formal.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.027275053784251213, 0.00914998259395361, 0.0008754919399507344, 0.0004687015025410801, 0.00014239145093597472]}, {"sequence": "We can say that Patria on King Street is the place to be if you want a relaxing brunch. It takes brunch to another level with its unique menu, intimate atmosphere and attentive servers. It does not have the same \"it's bright outside\" brunch dive; the room is dim, just perfect for those eyes who were out late partying the night before. Despite its fine dining setting, Patria's prices are competitive. Huevos Escalfado, for example, would only cost you $16. Your bill goes up depending on how much alcohol you would have. Even the price of coffee is competitive - less than $5. This is probably one of my favourite brunch places - away from crying children, the noise of banging utensils and smell of greasy potatoes.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.1850706785917282, 0.028269918635487556, 0.019550815224647522, 0.019280031323432922, 0.0007515847100876272]}, {"sequence": "Favorite Mexican spot in Toronto. Midtown location works out so well and saves you the trip to downtown for good food. Loved the crispy brisket tacos, the flautas and the burrito. The tres leches cake for dessert was to die for.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.021174052730202675, 0.001925612916238606, 0.0003271882887929678, 0.00015418350812979043, 3.787756213569082e-05]}, {"sequence": "A lot of Pros/Cons to come...Went here for a birthday dinner, and was seated inside... boy - was that a mistake.  There were only 4 of us and it was wayyy too tight! Two people literally cannot stand side by side. It was VERY hot, and very small. It is a great little hole-in-the-wall restaurant... which is literally a tiny hole in the wall.  If possible, ask to be seated outside!The Guacamole/Salsa were great - and was a good size to share among 4 people.  Would definitely recommend. We ordered a number of plates to share... but to be honest, I was not blown away by their tacos.  Definitely much bigger than El Carnita - that's for sure, and MUCH better value - but the taste was pretty average. We ordered... Tacos de: Pollo al Carbon, Pescado, Carnitas.The Mexican Street Corn is always my favourite part of these types of restaurants! Must have. The waiter was fantastic, and gave us a really cool run-down and lesson on types of Tequilas and Margaritas.  We were very appreciative! Loved the atmosphere... although it was a little too hot in there. Parking is hard to find, and it's surrounded by houses - if you're not in the area, I probably wouldn't recommend it.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.028220511972904205, 0.00926775299012661, 0.0043754070065915585, 0.0031028171069920063, 0.0024507262278348207]}, {"sequence": "Sadly, looks like this whole chain is going downhill. Was at the Dupont location about a month ago and the menu was different with fewer options, no specials and then my favourite drink that I always order, which is supposed to come with berries in the glass came as a pink sugary tasting mess that tasted like they put next to no alcohol in a glass full of pink lemonade mix. The food was bland and uninspiring compared to what it used to be. Service was barely there with no one coming around to take orders or check on us. Now their other location in the Junction has been shut down with a red card from Toronto health inspectors for pest infestations. I give this whole chain of restaurants another year before they start shutting down completely. So sad. Used to be my favourite for good tacos.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.136331707239151, 0.11912231892347336, 0.027412602677941322, 0.014866601675748825, 0.011459128931164742]}, {"sequence": "Came here for dinner with my friends and had a blast.The restaurant is small and has a cute outdoor seating area. The food was delicious, fresh and love the selection of hot sauces they had for me. We started off with the guac and chips. Guac was great. And we also ordered the bucket of shrimp. That was Delicious!!!!! The shrimps had so much flavor!!! I had the lobster tacos for entree. That was delicious as well. It was bursting with flavor, with a hint of spice, the cheese, tomatoes and guac on the side. Oh man! My friend had the carne asada. The steak was cooked perfectly. Tender and juicy and of course with the sauce on top it was bursting with flavor and a bit spicy. My other friend had the burrito and my husband had the short rib tacos. Alll were super delicious. The service we received were great. Our waitress was very personable and friendly and her recommendations were great. I would definitely love to come back here the next time I come to Toronto again.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.15528830885887146, 0.02535722218453884, 0.021700724959373474, 0.020426951348781586, 0.009693870320916176]}, {"sequence": "I'm always looking to try New Mexican places In toronto so we went to playa cabana . The place is fair small and has an authentic Mexican ambiance . I would recommend making a reservation ahead of time especially for dinner as there is limited seating . The service was a little slow overall. We ordered three appetizers Chips and salsa - 4/5 - the salsa felt like it was lacking flavourCorn - you get 4 pieces of corn - 3/5 - the corn was sweet instead of being spicy or more flavourful. Chorizo conquistador - 3/5 - basically bbq chorizo slices .For the mains we chose to get 3 hard and 3 soft tacos . Unlike other Mexican restaurants you cannot pick individual tacos . You have to get 3 of the same kind - hard or soft Hard chorizo taco - 5/5 - hands down the best thing we ate there. It was full of flavour and spice. It came with guacamole and salsa . The ground chorizo was way tastier than the appetizer chorizo slices . Soft taco - chicken with mango 2/5 - no flavour at all in the chicken . It was cold and lacked flavour all together . Either the chicken was made hours ago or the chef didn't put any time into preparing it . We are 1.5 of the 3 tacos and let the rest go back For dessert - you have 3 choices We opted for cheesecake with caramel . The cake was average and it was the equivalent of a grocery store cake . Overall - the ambience and select items showed potential but not sure if we are going to go back here as there are several other Mexican places that might be better . Will keep searching other hidden gems !!!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.02409069612622261, 0.004261486232280731, 0.0035701815504580736, 0.002509325509890914, 0.0001814817514969036]}, {"sequence": "First time coming here because I usually avoid places with lineups like the plague anddddd mannnn every time I drive past this place I see a lineup. Finally came on a Friday afternoon around 1:45PM and it was still busy, but luckily they had 2 bar stool seatings left just for us. Parking was a bit of a struggle, when we went the front parking was all full as was the parking on the side (also, alot of the parking is reserved for their neighbouring units). Not sure if they changed the ordering system or what, but we were a bit confused during our visit. Instead of ordering at the front like the others mentioned, the server was walking around taking orders and left the front unmanned. Whateva no matter really, just seemed a bit pointless to have him walking around taking orders. We just shared an Eggs Benedict w Smoked Salmon, Portabello shrooms, & Kale. This came with fried mini potatoes and a small, light salad. The potatoes and salad were fresh. But the eggs benny thooooooo... :( . My first qualm was with the English muffin it was on, it ain't toasted which makes it quite difficult to slice with the provided butter knife. Second complaint, that raw kale. I don't get it...why RAW? Imo, lightly sauteed kale with some seasoning would've made this dish much better. Kale doesn't really give you that crunch factor if that was the reasoning for adding it (nor does it really add any flavour). Also , the amount of portabello mushrooms were weak today. Also ordered a flat white, which was good. And a matcha affogato which is essentially matcha + vanilla ice cream, it was good as well. The service here is good - the servers were very nice. But the food came out at a snail's pace which I don't understand why since literally the only thing that needs to be cooked to order is poached eggs. Potatoes we got were just warm so it wasn't the taters slowing things down. Anyways, by the time the food came out, my coffee had already cooled down so that kinda sucked too. (Also I couldn't get that perfect brunch pic of latte art + food since the coffee came wayyyy before the food)Overall a lil disappointed tbh, overhyped. Thought the long lineups would have been justified but alas....I'll be back to try their pancakes though! Those looked pretty good.FYI... Cash or Debit only!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.17943565547466278, 0.028637168928980827, 0.01785622164607048, 0.013711865991353989, 0.00994736049324274]}, {"sequence": "This is one of restaurants that had been on my list for a while and decided to try it. The selection consist of variety from typical brunch menu. The space inside the place is limited and outside parking can be hassle. I had tried the salmon which I would say was very delicious. Overall, it was a great experience but the sitting arrangement can be a turn off as it can be crowded at times.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.05523405224084854, 0.03092445246875286, 0.0068200030364096165, 0.0014674729900434613, 0.00013926786778029054]}, {"sequence": "Service was good. Eggs Benny I give 3/5. The guac tasted old (brown in pic) and the hollandaise sauce went wrong. I think it was my dish only as the ones that I saw come out after had a better colour and consistency. It tasted predominately like unsalted butter.Matcha Latte 5/5. A little sweet but great temp and great amount of matcha.My friend got a classic brekkie. Tip: their toasting the toast means the toast is still white. ask for some colour if youre looking for some brown toasties.overall good atmosphere, need some work on the consistency.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.511505663394928, 0.14587655663490295, 0.0228671133518219, 0.01828824169933796, 0.007386978715658188]}, {"sequence": "Came here on Friday morning 930ish.  Can't find a parking spot.  Almost thinking to leave.  (I have to parked at an illegal spot and wait until someone leave so I can move my car.) It was pretty packed inside as well.  I have knocked over a lady's bag when i try to get to the bar table along the wall. Ordered the peameal bacon, cheddar, spinach avocado spread benny and matcha green tea latte. I liked the spinach avocado spread. The eggs were cook to perfect.  My latte just wasn't hot enough.  I will come back if I am lucky to find a parking next time.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.36385300755500793, 0.02611287124454975, 0.00910910964012146, 0.00490758940577507, 0.001978143583983183]}, {"sequence": "A nice and simple place for breakfast/brunch in Markham. I usually go for their simple breakfast (scrambled eggs, sausage, potatoes and toast) - they make their scrambled eggs well, not dry and overcooked like most places. Their coffee is good too (I think they use Pilot Roasters).My husband rotates between the regular breakfast, their pancakes (very fluffy) and their chicken and waffles (tasty, but the chicken is a tad small).It's a small place and always packed with a line during peak times, especially brunch on weekends. The biggest negative about this place is the lack of parking - there have been a couple of times we have driven here, circled a couple of times to find parking, and left. Tip: try your best to go off-peak meal times!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.00576090207323432, 0.0007132440223358572, 0.0004734582034870982, 0.00028221047250553966, 0.00020042667165398598]}, {"sequence": "Came on a weekday and though it was clearly busy the hostess had us seated in a cosy booth within 3 minutes. Service was eggceptional  and prompt but not rushed. I highly recommend ordering Eggsuberant as it contains all the same marveloussness as the high rise pancakes - but you'll actually be able to finish it! Great spot for brunch and to catchup with a friend before hitting the shops at Eatons!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.18470412492752075, 0.0016650495817884803, 0.0015899990685284138, 0.0006858742563053966, 0.00027951408992521465]}, {"sequence": "This place is worth whatever wait they may have. I had the classic eggs Benedict and they were the best that I've ever had. And the service here was awesome as well.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.5731908679008484, 0.003238474251702428, 0.00020066241268068552, 0.00016270906780846417, 0.00013469455006998032]}, {"sequence": "Great spot for tourists with big families due to its close proximity to downtown Toronto and the Eaton Center. But otherwise if you're a food snob (and I mean this with love) and/or long-time Toronto resident, stay faaaaar away from this place. The menu is extensive, but super basic and overpriced. There are so many better brunch places in a food city like Toronto, so save that $15-30 for elsewhere. Even Cora's has better food and value than here imo. Vegans beware, not many options here for you besides fruit. I ordered the Greek yogurt (0%) parfait with fresh fruit, granola, and honey on the side - decent sized portion and the ingredients were fresh, but for $11, maybe not so appealing. My friend enjoyed her pear, bacon, and caramel sauce waffles, but wasn't blown away or anything. The lines are quite long, especially on the weekends, but you can put your name on the waitlist and they will text you when a table is ready. We only had to wait for ~15 minutes despite a very packed venue.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.09356855601072311, 0.02909749001264572, 0.01303656306117773, 0.011316139250993729, 0.010951033793389797]}, {"sequence": "Came here on a Saturday morning and it was popping! However, the space is large and we were seated relatively quickly. The ambiance feels very airy and fresh with high ceilings and wood and cloth seating (though they still have the classic paper place mats present at all breakfast places...which I hadn't really wonder about until now...).I got a bagel breakfast sandwich and it was good,  with fresh ingredients, a lightly toasted bun and without the addition of an sauces (which happens at about 60% of chain restaurants even though I consistently ask for no sauce). Coffee poured freely, and waters were filled quickly. The pancakes and waffles and omelet were also delicious! It's a nice place, and I think I might come back for breakfast basics if I was in the mood.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.0635528415441513, 0.002701366087421775, 0.002523492556065321, 0.0022859987802803516, 0.0021547258365899324]}, {"sequence": "Food's good... BUT service was meh and food is definietly not consistent. They have a ton of different delicious looking options here. My boyfriend and I got the:Bravacado Benedict - OK.... dude... compared to the table sitting next to us.... we got no potatoes. I'm so sad because I love potatoes and you know, consistency is key. And our fruit pieces were also tiny compared to the ones of the tables next to us. Also, one of the avocados they used was SOOOO hard. Not ripe at all, but the other one was perfectly ripe. Like c'mon.. how hard is it to feel the avocado a bit and keep that consistent. Eating a non-ripe/not ready avocado is just not yummy.Smoked Salmon Benedict - This was fine, but not amazing. Came with the fruit side instead of potatoes, but you can switch it to potatoes without incurring any additional costs.Really wanted to love this place, but honestly would rather go get brunch somewhere else if I'm back in Toronto.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.4137972295284271, 0.07651450484991074, 0.011456434614956379, 0.009771749377250671, 0.004466432146728039]}, {"sequence": "Finally went to check out Barque Fri night. I know this place is hyped a lot because of the BBQ. The popcorn on the table is a nice touch. It is very addictive because of the seasoning on it. I went with a friend and we ordered the wings, ribs, brisket and sausage. The wings were the best. They were juicy on the inside and with a nice crispy rub on the outside. The ribs and sausage were good. But the brisket was a disappointment. I have been to Adamson BBQ a couple of times and their brisket is out of this world. Compared to Adamson, Barque's brisket is a bit tough. I won't be getting that again. I will definitely go back just for the wings. Also had a smoked bourbon cocktail and it was good.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.02512127347290516, 0.008495350368320942, 0.004690492060035467, 0.0019864910282194614, 0.00143129110801965]}, {"sequence": "3.5 stars Whoever is in charge of the menu or marketing is a bit of a genius... Barque Rack O'Bama.  Really??  This is honestly one of the best named dishes in Toronto and probably one of the key reasons why I tried this place before the other best Toronto BBQ places.Aside from the great name, Barque on Roncy is a nice family friendly bar.  Though the tables for 2 are really small and barely held the dishes on it, the space is bigger than most places on Roncy and you're not overly crowded.  There's a bit of bar seating for those who dont have a reservations and you do need a rez here.  It gets busy quickly on a Saturday with a constant flow of families.  Service here is friendly and fairly quick.  We were greeted and shown to our tables with no issues.  We had our food also delivered with an issue as well.Chopped Kale Salad - Ok I know I know... who gets a salad at a BBQ place.  Well I do cause I dont eat THAT much meat and I wasn't feeling mac & cheese or poutine side.  Which by the way looked monstrous.  We got a large and I will say its a very healthy size... easily feeds 2+.  It was nicely dressed and the pickled cabbage and carrots was a nice crunchy addition.  The fat white blobs of turnip... less so.  Mostly flavourless.  3.5/5Rib Taster - Star of the meal... you get 3 to 4 ribs per sauce flavour.  So the Barque Rack O'Bama, Sweet Heat, and Dry Rub.  I can safely say that the sauces and flavour is good.  There are definite clear smoke rings on these which is much better than most other places.  Were these tender?  Only one... the sweet heat.  Were they meaty? Kinda ... not really.  I found it weird they didnt take off the membrane on the ribs either so sometimes it felt like chewing through a tough plastic piece.  This is definitely above average ribs but I'm not sure I would order these automatically if I came back here.  3.5/5Brisket - We got a bit of the brisket as well and these were much better than the Smoke Signals and Carbon ones.  These were juicier and more tender.  And if you had the appetite of a hungry cub, you could order the larger size for only a few more dollars ($4 if I remember right).  Another good thing, I didnt feel the need to use the sauce for these.  Also, I liked how they were served above lukewarm temperatures (Carbon & Smoke was just barely warm)! 3.5/5Overall, it's a solid place on Roncy to dine with a group of family or friends.  Service is good and the food is solid too.  Though I dont think it's my favourite place in Toronto for BBQ, it can definitely understand why it is constantly filled on a Saturday night.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.7254869341850281, 0.621680736541748, 0.16786633431911469, 0.09305483847856522, 0.03582259267568588]}, {"sequence": "Had brunch a couple of weeks ago...Family friendly atmosphere, fast and very friendly staffs..Foods was superb and flavorful..The family enjoyed all the food they've ordered..Had the eggs benny with brisket and it was excellent...Wife had the ribs and was very delicious...What can I say... a must go to place if you ever around Toronto for some awesome food experience...Price is very reasonable...Staffs are very professional and fast service...Looking forward to coming back to try some of the other choices in the menu..Cheers....", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.16989582777023315, 0.011486905626952648, 0.0034383030142635107, 0.002142587210983038, 0.00041686027543619275]}, {"sequence": "Barque has the best BBQ experience in Toronto hands down. Chef David Neinstein makes the best dry rub chicken wings and baby back ribs in town. Their family feast dinners for $39 are well worth the trek to the Ronsy area. Their poutine, brisket, pulled pork, Brussels spouts and pretty much everything on the menu is worth trying. From the bucket of fresh bbq popcorn to the great selection of wines and beers, Barque is a great place to bring friends, family and large groups. Their service is always great! You do need a reservation as walk ins are hard to come by in this busy restaurant. If you can't get a table, try their younger sibling down the street called Bar Butcher Bar. They have a similar menu. I've had the pleasure of working with David and sous-chef Ronny as part of a video series we did for Canadian Tire and his passion for quality food is one of a kind. Keep it going David!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.004439669195562601, 0.0019721249118447304, 0.001412508892826736, 0.0010470778215676546, 0.000977922696620226]}, {"sequence": "a neighborhood go to for us...maybe its the addiction to the complimentary spice dusted popcorn.The menu is easy to navigate and delicious.  Love the brisket and the wings are a must try.  The potato salad option during lunch has a light flavour and one of our favourite sides,Ofcourse there are the ribs, but I'm impartial to the brisket and even have it with a bit of their mustard based bbq sauce on occasion.  Definitely call ahead if you can to reserve a table or you  might be in for a wait.  Lots of street parking  around and with Butcher bar just a few doors down, don't forget you can try that location that carries many of the same menu items!", "labels": ["Italian place with a burger", "A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.01176208071410656, 0.00913821067661047, 0.004355357959866524, 0.0035739655140787363, 0.0006041590240783989]}, {"sequence": "Spot on service and creative dishes that bring the flavour.I don't normally like ordering overpriced 18 dollar cocktails but hey this place looked like a good candidate to drop some money. Ordered my go-to drink a Manhattan (in this case a Burnt Orange Manhattan) and I can tell you that they put enough amazing ingredients into the glass to make me order a second drink. On to the food. We ordered family style (which is perfect since we were with our kids) and the waiter did an excellent job of suggesting variety and portions that made for a well rounded meal. He suggested we start with this epic pile of salad ingredients called the Singaporean-Style Slaw and it was the perfect start to the meal. Next was the tuna two ways and then the \"LUCKEE\" shrimp cheung fun. Both were delicate, precisely plated and had depth of flavour that both our kids (age 6 and 9) commented how much they liked. Lastly we had to have the Cheese Burger Spring Roll - and it tasted like a real cheese burger with none of the conventional ingredients of one!I had been meaning to dine at Lee for a year and will be back next time I'm in Toronto.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.21975843608379364, 0.07899420708417892, 0.023336591199040413, 0.018471695482730865, 0.004901729989796877]}, {"sequence": "This is not a restaurant you should pass up.  The food, the atmosphere and the staff make this a regular spot for me and my guests.  The unique menu and wine list make every meal different and a must for visitors and locals.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea"], "scores": [0.5181155800819397, 0.1864343136548996, 0.05657472461462021, 0.0007339800940826535, 0.0002495233784429729]}, {"sequence": "Came back for my cousin's birthday, so far beat restaurant in Toronto! The duck was to die for. The scallops were also amazing and the lobster raviolis where from the gods....If I had to go back I have no idea what would I order, every time I come a new dish surprises my palate. But obviously, I would always get the signature salad...", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.04173923283815384, 0.01954255998134613, 0.0017360537312924862, 0.0005577835836447775, 0.00026265825727023184]}, {"sequence": "Out of all of Chef Susur Lee's rstaurants that I've tried in Toronto, this one is my favourite by far. Who can say no to the famous Singaporean Slaw?The restaurant is great for a classy evening out, or for a chic celebration. The bar serves delicious cocktails, and almost everything on the menu is delectable.Singaporean Slaw - Instagram-worthy presentation and flavour bomb with various textures and ingredientsBlack Cod - Perfectly cookedWild King Garlic Shrimps - Paired really nicely with pickled green papaya, mango, and potato pea croquettesYucatan Sweet Corn Lettuce Wraps - This was just okayMango & Passion Fruit Panna Cotta - Sweet ending", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.001570996711961925, 0.0008051026961766183, 0.0004929261631332338, 0.0004384107596706599, 0.00028518293402157724]}, {"sequence": "Honestly I can't even think of words to begin this review. This restaurant is simply AMAZING. From the moment I entered, we were treated with incredible service. We arrived 30 minutes early for our reservation, and the manager personally took our drink order to enjoy while we waited for our table. The dim lights and ambience of the place made it easy to relax and enjoy dinner. Its a large plate sharing type of restaurant where a different server brings out each dish and describes it to you. We ordered multiple dishes and they even switched our plates and utensils between each order so as not to mix the flavors! The hostess was pleasant, and service was nothing short of what I would expect at this type of place. 5 stars from me! We ordered a total of 4 dishes to split between 2 people, which was a good amount because we were so hungry! If you're not really hungry, then 2-3 dishes shared between 2 people would be ideal. We of course ordered the 19 ingredient signature Singapore slaw, they bring it out in a huge tray and toss it in front of you - the server even let me take a picture of the salad before he tossed it haha! The salad itself was incredibly satisfying, the dressing was perfectly seasoned and the salad itself was light and refreshing which is surprising for 19 ingredients! We also ordered the goat cheese tarte which was delicious! The third dish was shrimp and lobster ravioli, 8 could honestly eat this ALL DAY LONG! The shrimp itself with the garlic sauce was perfectly cooked and melted in my mouth. As a shrimp enthusiast, I make sure to always order the shrimp dishes, and this did not disappoint. It was definitely one of the best shrimp dishes I've ever had. Lastly, we ordered the Top Chef Curry Chicken dish which is the winner of top chef. I honestly don't think I've ever had such perfectly cooked chicken, with a crispy thin skin. The chef recommends that you eat each bite of chicken with a piece of grilled pineapple and try the different sauces - mint with a spicy sauce and a coconut curry sauce. Honestly words cannot describe how delectable this dish was, I could eat this every single day of my life and not be bored!Overall, I highly recommend this restaurant and it's experience to EVERYONE, at least once. The one thing I have to add is that it is quite expensive, around $20-$40 per each entrée, so if you're on a budget I recommend trying 1-2 dishes and to make reservations for a special occasion! If not the dishes we ordered, there is definitely something on the menu for everyone!! This place gets 5 Stars from me. I will definitely be back to try everything else on the menu!", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.37379971146583557, 0.26786288619041443, 0.25162604451179504, 0.1998138129711151, 0.10581991821527481]}, {"sequence": "Great service and pancakes. The other breakfast food was ok. I think I'd try lunch or dinner to get a better idea of how this place is. Great ambiance too.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.14782032370567322, 0.007830442860722542, 0.002144609345123172, 0.002037016674876213, 0.00035847548861056566]}, {"sequence": "I was finally able to come here and try the highly recommended Mildred's pancakes and it did not disappoint. This is definitely the best pancake I've tried in TO. Soft, fluffy yet very filling -- if you have a small stomach I highly suggest you share with someone. In addition, I tried their soup of the day and scones. Honestly, I've been here before and anything I've ever ordered I've been highly satisfied with. Great quality, beautifully presented! The staff are very attentive and quick to serve as well.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.07349276542663574, 0.005640930961817503, 0.0020664904732257128, 0.000794228573795408, 0.0005753407021984458]}, {"sequence": "Came here on Sunday morning for brunch with friends based on a recommendation. Was told to go early, and happy we did. There was already a line up before opening at 8:50am, and by 10:30am another line started forming. We had the famous pancakes and the granola bowl with in season Ontario peaches. Yummy. The pancakes with blueberry sauce, were so thick and fluffy. Definitely worth a try.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.09677741676568985, 0.0016086226096376777, 0.0010743162129074335, 0.0009787193266674876, 0.0006392907234840095]}, {"sequence": "This popular brunch spot in Liberty Village always has lineups out the door, and it was not hard to tell why.Frisee or Endive Salad with Mushrooms, Smoked Salmon, Poached Eggs - delicious, filling, not too heavyButtermilk Pancakes with Blueberries - very fluffy pancakes, but a bit too sweet", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.020563017576932907, 0.0003530689573381096, 0.0003155397134833038, 0.000184698001248762, 7.166628347476944e-05]}, {"sequence": "Everything we ordered was so mediocre. The food was not horrible but it was definitely nothing special. I feel like I have wasted my calories. Environment and service is good. I personally would never come back again. We were there on a Saturday for brunch. We had:Eats, Shoots & Leaves with salmon: just a very basic veggies salad, nothing more special than any salad you can get at a grocery store Big B'Lunch Skillet: tastes slightly better than other dishes but again nothing special Blueberry pancakes: it does not taste bad but I can't really remember any other blue berry pancakes tasting worst than this.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.463650107383728, 0.2587681710720062, 0.019237076863646507, 0.005715547129511833, 0.0025628376752138138]}, {"sequence": "Ahh this place was such a gem. It's a cute super authentic restaurant with a simple but effective menu. They don't overwhelm you with a lot of options and there are just main dishes on the options (no appetizers unfortunately). The service was quick and they took the time to explain if we wanted the \"tea rice\" they make with the leftover rice. This place has seriously raised my standards for good authentic Korean food because it was so yummy! BUT- I do have to take off a star because they got two of my friends orders wrong. It was a little confusing and I'm sure it doesn't happen often after reading some of these other amazing reviews. I'd definitely recommend coming here if you're craving Korean!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.009910885244607925, 0.00459093926474452, 0.0039059724658727646, 0.0013258334947749972, 0.00040848186472430825]}, {"sequence": "Delicious soon tofu! The menu is small and pretty limited, as their main focus is on soon tofu. The ingredients are typical i.e. seafood, beef, pork, tofu, vegetables, etc. The portion size is filling enough for dinner and a steal at around $10 for the stew and rice, in addition to refillable side dishes. They also have items such as bibimbap (beef only) and bulgogi soup, both of which are delicious and worth trying if you get tired of soon tofu.The restaurant is pretty large so getting a table should not be very difficult, even on the weekend. Service is fast, attentive, and efficient. They accept both debit and credit card for payment. Definitely one of the best Korean restaurants in the Annex!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0027127976063638926, 0.0009701586095616221, 0.0007152818725444376, 0.00023864310060162097, 0.00016401964239776134]}, {"sequence": "If you want some fast and inexpensive Korean, this is a good place to go. We shared the Hot Stone Bibimbap which of course came with all the regular side dishes and was very tasty.When we sat down we didn't have a box of chopsticks and spoons at our table, and our server also initially neglected to bring us bowls with the food which was kind of a bummer.The beer selection is a little limited (domestic usual suspects + Asahi) but hey, what were you expecting? And it's cheap (5 bucks)!Sure, the decor is a little gawdy, and the menu limited, but that's all part of the appeal for a place like this: quick, simple, good food for your money.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.7064765691757202, 0.005968681536614895, 0.004030369222164154, 0.00025662267580628395, 0.0002256754960399121]}, {"sequence": "I saw this restaurant featured in an episode of Kim's Convenience (season 1) and ever since then, I've wanted to try it. I ordered the most popular dish combination soon tofu and dolsotbab with beef, shrimp, and mussel. The stew came with a few slices of pork, one mussel, one unpeeled shrimp, and an ABUNDANCE of tofu. It also came with a hot stone pot of purple rice which was scooped into our bowls by the server. The server then poured water into the hot stone pot and left it soaking on our tables. I was unsure if there was a purpose or they wanted to grab all the dirty dishes together. Puzzled, we ate with soaking wet rice on our side.The stew was okay, the soup wasn't too rich in flavour. Maybe it was because I didn't ask for it too spicy. It also came with an egg on the side you crack yourself into the stew which is pretty cool. I love rich stew and the soon tofu wasn't the greatest for me. I hope their other dishes have promise and I believe they do based on the number of customers. The prices at Buk Chang Doon are definitely competitive compared to their Korean restaurant counterparts in Koreatown. Good service and convenient location!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.035774730145931244, 0.01833626627922058, 0.015184241347014904, 0.013484280556440353, 0.010425648652017117]}, {"sequence": "Discrimination against Chinese. Assigned bad table to us, even though there are lots of other tables. No matter what you order, you mostly get tofu and rice. Worst restaurant in my life.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.0040937322191894054, 0.0003547827072907239, 9.98043833533302e-05, 8.673824777361006e-05, 5.291954585118219e-05]}, {"sequence": "Greek salad was tasty.Pork souvlaki was good.Tzatziki and Pita was very good.I'm giving this restaurant a 3'star because I ordered a Messini salad and it was tiny and consisted only of lettuce and balsamic.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.008050436154007912, 0.00013039643818046898, 8.95021585165523e-05, 8.508702740073204e-05, 3.7298905226634815e-05]}, {"sequence": "Gyros taste disgusting, didn't get order right and not a good environment. Staff doesn't even let you read menu before they're asking you what you want , rush you out the door after you've been served", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.025502655655145645, 0.0162632055580616, 0.00013737045810557902, 0.0001356885622953996, 4.2412877519382164e-05]}, {"sequence": "Came here on a Sunday around 1:30pm and there was a 5 minute wait to get seated. Pros:- Well priced- Food tastes goodCons:- We ordered a gyro dinner and they forgot to bring the gyro... Other than that is was up to par. - Saw a mouse running around under the table", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.48861783742904663, 0.026830200105905533, 0.002402876503765583, 0.0008327107643708587, 0.0007868731627240777]}, {"sequence": "Stopped in before heading to the airport, was around lunch time and we were in somewhat of a rush. We were seated at a booth at the back of the restaurant with a view over the door and the service area, our waiter dropped our menus right away and took our drink order (Water) after about 10 minutes he came back too our orders( I'm pretty simple when it comes to greek food), so i went for the \"never fails\" Gyro. That was the last our waiter visited our table!!.After about 20 minutes our food was dropped and it was average at best. The meat was drier than it needed to be, and the fries were OK. After about another 15 mins we picked up our check and paid.The positive from this experience was, we were in and out fast. Not somewhere that i would return, unless i'm in a hurry and looking for average (at best) gyro's.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.2797958552837372, 0.04720862954854965, 0.030863234773278236, 0.027238089591264725, 0.008185925893485546]}, {"sequence": "If you're looking for good service and will become irritated easily if you don't, you may not enjoy your experience. Otherwise, if you're satisfied with the fact that as long as the food gets delivered and they come over when you flag someone down, then you should be ok.Take the TTC, get off at Chester, and it's a minute-walk over.Food is good and affordable. Get a gyros for under $6 and it comes with a lot of fresh meat off the spit and soft fries! I typically come here just for it.Another item that I like is the gyros pizza, which is a personal sized pizza with cheese, vegetables, and meat. It's not greasy at all, which provides a pleasant tasting experience since I'm not a fan of greasy pizza.Sometimes they'll try to bring all the food at the same time, so if you order the pizza for example you will end up waiting a bit longer than others that get gyros or rice dishes.One of those places that's safe to organize a lunch or dinner at, though it can get busy.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.3108457326889038, 0.08437575399875641, 0.05180898308753967, 0.03237006440758705, 0.023579634726047516]}, {"sequence": "It delivers on its name? lolIf you're craving freshly made dumplings, this is your standard Chinese dumpling restaurant. It's a tiny space in Chinatown, which looks a bit more run down nowadays, but this place hasn't changed a bit. It still has the bright red tables. Well .. some things have changed. The prices are higher now, ~$10 for 15 steamed dumplings or for 12 pan fried dumplings. There's a variety of meats/vegetables to choose from.They speak (broken) English, since they're a lot of locals and tourists. Service was meh. It's quite busy, they're in a rush to get you in and out.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0027302156668156385, 0.0006136320298537612, 0.00022728295880369842, 0.00021490821382030845, 0.00016509606211911887]}, {"sequence": "A great place for dumplings and other small dishes!I have literally not stopped thinking about the pork and cabbage dumplings. They were SO juicy and flavourful - I like them steamed but I'm sure they'd be great fried too! We also liked the shrimp/vegetable option and would recommend, but the pork was truly the star. And at $9.99 for 15 plump dumplings, you really can't go wrong. My only regret is sharing them with my friends. The space is a little cramped and the service is blunt, but I feel like that's how all the best Chinese restaurants are. Maybe that's just me. Note: they only take cash so plan accordingly.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.004373684525489807, 0.0005774209275841713, 0.0004956410266458988, 0.00025702864513732493, 0.00019600658561103046]}, {"sequence": "We were looking for some Dim Sum, and happened upon this place.  The inside is TINY, and we beat the rush, just barely.  There was a line the whole time we were seated.  We made our choices quickly (15 dumplings for $10 and house special kung pao chicken for the same).  The special arrived super fast, and was delicious!! It was tricky for some of us to use chopsticks to eat the rice, though.   The dumplings took quite a while, and we weren't told which were which, so we gambled on which were shrimp, veggie and chicken.  Having never sampled Dim Sum, we weren't sure what to expect.   It's not something we would order again, but we WOULD try to eat here again!  Staff was friendly, prices reasonable, seating comfortable,  and added bonus was watching the ladies make the dumplings!", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.019483840093016624, 0.014431769028306007, 0.005429000593721867, 0.003377932822331786, 0.001865379512310028]}, {"sequence": "Always walked passed this restaurant in Chinatown but never actually went in to try but after seeing the reviews, we had to try it and it did not disappoint. We got the House Special Noodles and the Steamed Pork and Chives dumplings. The noodles had a very tasty sweet sauce and is definitely great to share as the flavour might get tiring after a few bites. The dumplings were also pretty good! $9.99 for 15 dumplings and they were pretty big and also great to share because they are very filling. Each table also has their condiments in which you can make your sauce to dip your dumplings in with how you like it. The dumplings are also freshly made in the front of the store which gave this place a very authentic feel and the service was very fast! No complaints. Definitely want to come back and try their pan fried dumplings.", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea"], "scores": [0.06120044365525246, 0.0490751676261425, 0.00898060854524374, 0.006615436635911465, 0.0031981971114873886]}, {"sequence": "Delicious. Whenever I'm craving dumplings from home I know I can come here and leave satisfied. They don't taste exactly like home but you won't hear me saying these don't taste GREAT.I wouldn't really waste my time on the fried dumplings, though I can see why they might appeal to other people. I've tried the lamb and the presentation was fun.But the boiled dumplings are where it's at: plump, nice wrapping, generously filled. The pork and shrimp is always a go-to: lots of pork, big full shrimp in each dumpling. I also like the pork and chive, and pork and fennel. Both generously filled also.The regular dishes are also worth your time and money! Mapo tofu: delicious, the garlicky sauce is amazing with the rice. Shanghai fried noodles: alright, super saucy if that's your preference. Egg and tomatoes: really, really good. They taste great. Kung pao chicken: tender, real pieces of chicken, generous, delicious. Spicy glass noodles: nice and chewy.By the way I've tried Mother's Dumplings before and would never choose it over Dumpling House, come here instead!!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.046361152082681656, 0.020963730290532112, 0.016189418733119965, 0.00725135300308466, 0.00690107699483633]}, {"sequence": "HORRIBLE HORRIBLE EXPERIENCE!We booked this place for a big game, more than a week in advance. We arrived on-time only to find ourselves behind a support pole completely blocking the screens. I tried to explain to them, no one comes here for their insanely overpriced pints or food, they come to watch the game! But they could not have been more dismissive.Very unreliable! Go somewhere else if you can.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.15394210815429688, 0.09696970134973526, 0.09693310409784317, 0.05250918120145798, 0.003705869195982814]}, {"sequence": "Good staff and food is ok. Overpriced.Drink selection is great however, still overpriced.Location is great for out of towners.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.37015050649642944, 0.36572232842445374, 0.2424960732460022, 0.03716478496789932, 0.02729637920856476]}, {"sequence": "As someone returning to Canada after 4 years abroad, I thought I should re-teach myself to be Canadian by watching hockey and eating wings. The big screen is epic and there are screens everywhere including the bathroom so yeah sports!!! The wings were also epic especially the medium flavor. The honey garlic were meh as a flavour but the crunch and texture of the wings were still 10/10. It's kind of overpriced but decent service and a good place to watch hockey and down wings.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.19101986289024353, 0.006068479735404253, 0.0010945345275104046, 0.0006420554709620774, 0.00017976983508560807]}, {"sequence": "Came for my birthday dinner with the wife and mother in law. Watched the Maple leafs?), ate great food got a free desert for being so old.The biggest sports screen I've seen in a bar.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.04977620020508766, 0.026517190039157867, 0.0074698138050735, 0.0004999232478439808, 0.000223288603592664]}, {"sequence": "Ambiance, amazing. Wait staff, helpful, funny and efficient. They seem genuinely happy to be there. Food, fabulous. Always 100% happy when I'm here. Granted I'm usually going to a game or concert and start out happy anyway but the experience here always reinforces the good mood! Reservations are important before a game. I'm trying to get creative on this one but I've eaten lots of different things, can't recommend just one, they are all good. Nothing but happy, glowing things to say. I had a gummy bear martini thing - ok I had many many gummy bear martini things - sweet so don't try it if you don't like sweet drinks but wow was it good. Those sweet martinis helped me better deal with how old and awful Depeche Mode is, later that evening.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.3149564862251282, 0.22603631019592285, 0.19274462759494781, 0.06755218654870987, 0.009192242287099361]}, {"sequence": "The good: Build your own pizza...do it because you get to load all the toppings you want! I piled mine up sky high and, it tasted amazing. The prices and portion size are well worth it. The staff are very friendly and it's like an assembly line when you order but they are so on top of things, they can't get your order wrong. I loved this place! The bad: Nothing.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.012499566189944744, 0.0032135953661054373, 0.0017315874574705958, 0.0008440524688921869, 0.0002734650915954262]}, {"sequence": "No one eats more than I do. Seriously.I am a fat, fat man, in a little man's body. All I do is eat, then walk to the next restaurant to burn off a couple calories to eat again. I've eaten all over this great city but only started writing reviews now because the Ball & Chain's sister got invited to Yelp Elite and she can't even boil water and only eats where I tell her, so here we go:Whoever doesn't give this a 5 is nuts. You can literally make any pizza with unlimited toppings for like $14 or whatever. If you don't give it a 5, you don't know how to top a good pizza.I'm not a tradition guy, so simplicity with pizza irks me. I counted and had a 23 topping pizza and it was delicious. All my pizzas there have been between 19 and 23 toppings and all delicious.Key toppings are: Spicy sauceGOAT CHEESE (essential)PepSausageExtra Pineapple (essential)Hot peppers (essential)Spicy and sweet is the best combo and don't listen to those weirdos that say pineapple on za is blasphemous. They are fools. Hawaiian pizza sucks, but pineapple with hot peppers and pep is delicious!!I've eaten at every pizza joint in Toronto basically (descendant, libretto etc) but I can design a pizza that tastes better here. Execution might not be quiiiite as good but the flavour destroys it and it's still cooked well.Shout out to the stinging bee pizza at king taps that seems to have started the sweet and spicy pizza trend (north of Brooklyn seems to have jumped aboard) in Toronto (tho I've done it for years...still awaiting my royalty cheques)", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.2497263252735138, 0.10246361047029495, 0.06970851123332977, 0.02477162890136242, 0.013500532135367393]}, {"sequence": "You'll go for the first time and wonder if the lineup is really worth it at lunch. You'll wonder why they don't load up on all the toppings like they do at any other pizza store. You'll question how a pizza can cook in a couple of minutes if you load it with toppings. You'll wonder if it'll even be filling since the crust is so thin. Then you'll take a bite out of it and all those thoughts will go away. This goes without saying: build your own pizza. Take advantage of all the different toppings they have to choose from, and watch the oven work it's magic before taking a bite out of one of the most delicious pizzas you'll ever try. There's a huge difference in having a pizza that's made to order with quality ingredients. If you don't think that pizza can get much better than the chains, make your way over the Blaze.Oh, and the customer service is pretty top notch too.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.0347304604947567, 0.03200344368815422, 0.028886929154396057, 0.020873088389635086, 0.005230666138231754]}, {"sequence": "Love Love Love this place! I was a Ryerson student and I've been walking past this restaurant for over a year but I've never bothered to try it out thinking that it's just a typical pizza place and there are other less fancy pizza places for cheaper price. What got me interested is their Build your own pizza concept with unlimited toppings FREE ($12.85). I don't know any restaurant with this kind of offer and it is a very fair price in this market. When we went on Sunday evening at 6.45pm, there was a line-up to the door and it took us 10-15mins to get to the order-taking/build your pizza station. I chose half classic Tomato sauce and half garlic Pesto sauce with extra mozzarella cheese. The guy putting on the cheese only added a little more when I said extra though and it was a little awkward to ask him more. I then had Smoked Ham, ground beef, red onions, roasted garlic, spinach, green pepper, mushroom and pineapple. They then cook it in an open-fire-blazing oven. Waiting for the pizza to cook took 5-10mins. It didn't seem too long as the person prepping the cooked pizzas were doing his job so fast and it was entertaining/fascinating to watch. I then added barbecue sauce drizzle. Another reason why I love this place is their additional cheese, Tabasco sauce, Sriracha, herb, and chilli flakes available on the side. I am a cheese lover, and I like a little spiciness in my food. I will definitely come back. Food: 5/5Price: 4/5Cleanliness: 4/5", "labels": ["Italian place with a burger", "A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.05324402451515198, 0.03465628996491432, 0.026360295712947845, 0.019244061782956123, 0.006297058891505003]}, {"sequence": "I highly recommend this place to anyone who is looking for good pizza. The variety of toppings, cheeses and sauces are great. The staff here are super friendly and very generous with the toppings. The service is fairly quick, the atmosphere and the restaurant are quite pleasant. I will definitely be back again.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.0016706339083611965, 0.0013287384063005447, 0.0007152275065891445, 0.0004494189633987844, 0.0002609583898447454]}, {"sequence": "Awesome food. Same quality that I experienced 12+ years ago. I brought some coworkers who recently move from India to Toronto and they loved it.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.5052975416183472, 0.397862046957016, 0.349323034286499, 0.01665368862450123, 0.006920698098838329]}, {"sequence": "Must try their Lamb Biryani..it's amazing. The food is not really expensive and worth the money. Two people can eat a really huge amount of food there. Best biryani we've had so far in Toronto. Thank you guys for this wonderful meal.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.30124008655548096, 0.04039817675948143, 0.0020257525611668825, 0.0020033949986100197, 0.0010486268438398838]}, {"sequence": "Walked over an hour to get because a guy in my hostel told me this was the best Indian / Pakistani food in Toronto. I ordered  two of the lamb chicken and beef kabobs , a side of garlic naan and a samosa .The food was spiced and cooked to perfection .  My only qualms with this place are that the Kebabs are on the smaller side and you  can't adjust the heat level since the meat is premarinated. You can add a side of chiilis but it's not the same .  . Whenever you go to an Indian spot and get tandoori items you usually get a green sauce as well as a sweet purple / red sauce .which I got with my kebabs here .With the exception of the raita this place offered the best duping sauces I've ever.I highly recommend you check this place out if you're planning to visit Toronto and have a hankering for Indian .I'll definitely be back .", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.26687827706336975, 0.015595058910548687, 0.0021306141279637814, 0.0013859935570508242, 0.0010214346693828702]}, {"sequence": "Best naan anywhere. Do not go without ordering their naan!!We absolutely love their butter chicken. Our classic order is two butter naan with the butter chicken and this is the right amount for two people without overdoing it. I've only taken one star off because we would love to order the rice but it's so blinking expensive (even though they do give you a lot - better value for 4 people and still enough rice). The chicken and beef kebabs are quite good as well. We never begrudge ordering a kebab or two if we go in extra hungry!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.07644391804933548, 0.060554489493370056, 0.005357394460588694, 0.0036232154816389084, 0.0021649429108947515]}, {"sequence": "I loveee indian/pakistani food. But there is something so unique about this place, it feels as if you are in your grandparents home. The amount of grease,spice,atmosphere. Its just beautiful. Everyone's is there to enjoy food. If you are in to looks u will get disappointed, but dont get me wrong its clean....", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.07240575551986694, 0.001150675117969513, 0.0003413210797589272, 0.0001085041876649484, 0.00010579120862530544]}, {"sequence": "We got combo 13, it was A LOT of food, the server recommended a smaller combo, but our eyes were bigger than our stomachs... we had so much left over, but the food is tasty and the customer service is exceptional! Definitely would go again! They give you more food then you expect to get, the portions are very generous!", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.7296592593193054, 0.6132787466049194, 0.5998034477233887, 0.05091439187526703, 0.012596435844898224]}, {"sequence": "Fishman lobster clubhouse is a must visit when in Toronto for seafood lovers. The restaurant walls are encased with tanks of lobsters, king crabs, Dungeness crabs...you name it. Our party of 8 ordered the pre fix family style meal (item #G) which says for 6-7 ppl, but it was definitely more than enough food to feed all of us. We ended up with a party tray of leftovers. They start you off with soup followed by deep fried large oysters in sauce, king crab/ lobster towers, fish, pea shoots, and lobster roe fried rice. There's also dessert!The stellar items from our meal was of course the king crab (6lb) and lobster (7lb) towers. Both were prepared in similar ways. The king crab (HK style) was deliciously coated in a blend of seasonings that included a light mix of sweetness, tanginess, and savoriness with a bit of a kick but not spicy. The fries that surround the king crab tower are what you've never had elsewhere. It beats your local McDonald's or Burger King any day. Covered in the same seasoning, the fries are so addicting and will have you reaching for more without realizing it. The lobster with dried garlic is so plump and juicy. Coated in the same light batter, it was similar in taste to that of the king crab but without the sweet and tangy flavor. If you think the lobster meat is a bit bland, just coat it with the dried garlic to add extra crunch and taste! By the end of our meal, we were waddling out of the restaurant. The price is unbeatable for the quality. The amount paid per person was just as much as what we might have paid for just an entree with drinks at a restaurant in NYC. I will definitely come back the next time I'm in town!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.03468842804431915, 0.020796379074454308, 0.01962815597653389, 0.00888313353061676, 0.008346552960574627]}, {"sequence": "I am enthralled. The style, the menu, the clientele - all of it. 10 lbs lobster mountains, presenting your crustaceans prior to cooking, Chinese families and gangsters alike - this place is everything and I can't wait to come back.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.21295060217380524, 0.035073015838861465, 0.0049734292551875114, 0.0005477966624312103, 0.00047198537504300475]}, {"sequence": "So delicious. Not only did we look this place up and saw that it had great reviews but my friend also recommended this place to us on the list places to eat at Toronto. Was able to call the day of for reservations for 3 and they had a 7pm opening. I recommend you make reservations because this place get packed! Parking was fine when we got there but was crazy when we were leaving. I can tell that besides families, a lot of big groups (10+ people) come here too. For the 3 of us, we got course E. And we loved every little bit of it. Side note: the pricing they have on the menu is more or less what you will pay. Depending on the size/weight of lobster/crab they have, the pricing can change a bit. But your server will come over to your table (with the live lobster and crab) and show you the price difference you'll be paying. And at that point you can decide if it's okay or not. Every dish was so sooo so good. The meat on the crab and lobster was juicy and flavorful. Can't complain. And the portion size is HUGE so most tables definitely had to go trays (yes, trays) and boxes. **No credit cards accepted! So for all you visitors (like us) make sure you have CA$H on you!!! They will take American dollars**Overall the service was fine. Everyone who we spoke to were friendly. They did forget about us for a moment and forgot to bring out the fried rice to us. We had to ask twice for it. Sure it's not cheap for a family dinner but trust me, it's worth it. And think of it as you can get 2 delicious meals out of it because of the big portion size.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.3964085578918457, 0.2990601062774658, 0.2840646207332611, 0.16452060639858246, 0.16271749138832092]}, {"sequence": "Fishman Lobster Clubhouse is our go-to place whenever we want to impress guests from overseas. This is because in Asia, imported lobster can cost an arm and a leg. A heaping mountain of fresh lobster meat is still impressive every time when we see it arrive on the table!The menu has multiple combo options that of course revolve around lobster or king crab. Meal price is based on weight of the seafood, and the live lobster is brought to you for inspection before it is prepared. Within a short time, the huge lobster mountain will arrive, assuming that's the style that you ordered. The large pieces are fried with a delicious and light batter but the meat remains tender inside. Definitely suggest picking the lobster pieces using the gloves that they provide since they're quite greasy. The accompanying dishes such as snow pea leaves with goji berries (superfood apparently), lobster roe fried rice and steamed fish are all consistent and come in huge portions as well. By the way they can also drizzle the lobster batter with salted egg yolk if you ask for an additional $40 or so, it does further enhance the flavours a bit but we didn't think it was worth it as you're here for the abundant seafood meat. The lobster can get to be too much of a (greasy) good thing by the end, but staff are quite willing to pack your food if required.Lunch time is the better deal for combos but dinner time may be more suitable for large table reservations for a lobster feast. The restaurant recently relocated south to a larger venue to handle more happy customers. Also be prepared to bring a wad of cash bills as the preferred form of payment.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.05432555824518204, 0.023589443415403366, 0.020344329997897148, 0.019709009677171707, 0.010324975475668907]}, {"sequence": "My boyfriend and I went for date night and we were super excited because we heard so many positive things about this restaurant. Prior to going we took a look at the previous yelp reviews/photos and were impressed by the menu diversity. We called to make a reservation and was nicely greeted and helped by the hostess. The food quality is great- expect fresh sashimi and a lot of yummy sushi rolls. I really enjoyed the special which was eel with gold flakes. Ou- also the mango slush was sooo good, it was more like an actual drink instead of a dessert. Service was average- nothing out of the blue. The atmosphere was modern and clean! We would definitely come back again. :)", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.1460372656583786, 0.03451814875006676, 0.015527334064245224, 0.008980895392596722, 0.0021114610135555267]}, {"sequence": "This place was a nightmare I saw good reviews and stars so i recommended to my friend who i hadnt seen in forever that we go there .. We went for dinner, There is absolutely no good variety on the menu. Each category has like 5 options in it FOR DINNER & the quality was very mediocre Service was crap, had to wait like 10 minutes before anyone even spoke to us about seating, theyd walk by and not look at you & for the absolutely nothing that they offer we paid over $30 per person.Not recommended.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.6610091328620911, 0.5662183165550232, 0.4934711456298828, 0.29834434390068054, 0.040521275252103806]}, {"sequence": "This restaurant was the buzz of the town a while ago, but my husband and I finally decided to try it out on Valentine's Day for an early dinner.The restaurant is visually appealing -- however, when I made my way to the back to use the facilities, there was an employee taking a nap in the hallway (which was very odd to me).The service was decent, the food was okay -- but they do have some delicious highlights (ox tongue, torched sushi, the desserts were yummy!).  Was it worth the price? To me? Not so much.", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "A cafe that also offers beer", "An ice cream shop with bubble tea"], "scores": [0.12899191677570343, 0.06646614521741867, 0.024570025503635406, 0.004291824530810118, 0.0014241979224607348]}, {"sequence": "Really enjoyed my dining experience at Kaka. Probably the best ayce sushi restaurant in the GTA.It costs $33 per person to do the ayce on weekend nights, but I thought it was worth it.Most item were well prepared and very yummy. I highly recommend getting their chicken wing, lamb skewer, press sushi, torch sushi, and their desserts. Maybe avoid their soups, they were very salty.The service was good too. It was fast and attentive.I would go back for lunch in the future.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.2509492039680481, 0.07055142521858215, 0.05743595212697983, 0.019798193126916885, 0.011910841800272465]}, {"sequence": "Updating to three stars...Customer service responded, which I appreciate.  \"Hi Johnny, We are sorry that our food is not up to your standard. Please accept apologies regarding above issue. We already report to the management office, were you there yesterday? Your opinion is important to us! Your sincerely, KaKa all you cane eat customer service\"This is what restaurants should do to better themselves if a negative comment has been reported.  This is truly a satisfactory response.For Kaka All You Can Eat...Please do ensure that whatever food is supposed to be hot remain hot such as the fried dishes which we ordered this Saturday.  I know that you are a busy establishment but management should have better coordination of their employees.  I wish you the best of success.  Cheers!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.26607853174209595, 0.22071979939937592, 0.14418858289718628, 0.1300571709871292, 0.05756691098213196]}, {"sequence": "The service was terrible while they don't let you share food. The boss was rude, he went straight to my friend's table and told them he didn't accept calling extra large pho bowl and share. He only accepted two small pho bowl. It wasn't worth money. I would not recommend this restaurant", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.32072535157203674, 0.049493372440338135, 0.03443882241845131, 0.024795183911919594, 0.0022832462564110756]}, {"sequence": "CHECK YOUR CHANGE THEY TRIED TO JIP US $5 and THEIR MEAT WAS DISGUSTING. They are CASH ONLY.The male Vietnamese boss is very rude. He stands at the door and checks everyone's orders to make sure you meet the minimum. He doesnt smile unless you're definitely a tourist (judges by race). There is a minimum of $6 per person charge and not allowed to share anything. He came over and specifically told us that. You also can't take anything home with soup if you don't finish. I Do NOT recommend. GRATUITY IS INCLUDED FOR 5+ otherwise I would've given 0!!!!!TLDR: BAD SERVICE, DISGUSTING, DIRTY FOOD. Only popular cause it's on a popular street full of tourist who would never come back.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.11906721442937851, 0.02301991730928421, 0.018921293318271637, 0.017739566043019295, 0.007151785306632519]}, {"sequence": "We were hungry. We were cold. We're tourist trying to eat a warm bowl of pho before continuing with our day. This review will be short. The service was bad. The waitress just handed out the order slip and a pen for US to write down our order. She walked away as we were asking for some info. The coffee came last even though we specifically asked for it first. FYI, most Vietnamese restaurant brings it first. The food?! BAD. We ordered pho, congee, shaken beef. The shaken beef was super bland and the rice that came with it was probably yesterday's rice. I had the pho. I got sick. My sister had the beef and her stomach made weird noises. It didn't even sit well with her boyfriend either. Bad service, bad food. Sorry.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.3550654649734497, 0.009802326560020447, 0.008400139398872852, 0.008305498398840427, 0.0031510237604379654]}, {"sequence": "Came here for lunch with a few coworkers, randomly chose a spot to eat so there was no expectations for this place. The inside was a bit on the rundown side, typical Chinatown restaurant. The decoration and atmosphere resembled most pho places. Everyone ordered pho, nothing complicated and pretty standard. If it was just based on food, this place would be average and not a bad place to grab some pho in Chinatown. But the service was terrible, if not the worse. One coworker found a piece of plastic in the soup, of course they stopped eating and waved down a waitress immediately to inform them. The waitress didn't seem to care and also tried to play it off as if it's a normal thing that could happen. Tried to explain how the plastic was probably used to wrap the beef, its clean and there's really nothing wrong with it being in the soup. Really felt like an argument which later resulted in asking for the owner instead, coworker could no longer talk to the waitress calmly.Overall, there's better pho out there so definitely won't be coming back in the future for waitresses with attitude.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.10404060035943985, 0.08714094758033752, 0.08204404264688492, 0.04308152571320534, 0.015940260142087936]}, {"sequence": "This is more of a 3.5. Not much to sing home about, but pretty solid Vietnamese food. The beef pho, bùn noodles, and fruit shakes (avocado in particular) are pretty decent. Very casual atmosphere. The wait has never been too long. Service is okay; you may need to flag down your waiter to order, get water refills, and to pay your bill. I definitely wouldn't come here for a fancy night out, but good enough to satisfy your craving for Vietnamese food in the heart of China town.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.22992800176143646, 0.0049440315924584866, 0.0014812367735430598, 0.000694422225933522, 0.00041813525604084134]}, {"sequence": "I can't give my money to this place ever again.  Let's set the stage.  David Chang is part of the new cohort of 'celebrity chefs' - in his show, Ugly Delicious, he talks extensively about the cultural nature of cooking.  For first generation immigrants, many parents, who may not have been professional cooks in their homelands, made their way to a new place and opened restaurants in hope of providing for a better future for their children.  They did not want their children to work in the kitchens, they wanted their children to be doctors, lawyers and other professionals.  David Chang himself relates that as a chef, you cannot make really great money until you hit a level of superstar-dom. So once you get that name brand recognition, that legitimacy, diners really have to be aware, is this true to what originally made it great?  Momofuku Noodle Bar in Toronto had a rough start.  They first opened during an unseasonably cold winter season without an understanding of the Toronto restaurant market, i.e. Torontonians tend to retreat to our homes during the winter and there will be substantially reduced traffic.  The pricing of their bowls was also substantially higher than the existing ramen shops already in Toronto.  Does Momofuku deliver on that name brand recognition?  At least for the vegetarian offerings, which initially was only the one scallion bowl, with one soup ramen later added, they're greasy and salty.  The umami presented wasn't an array of flavours, it was more, here's some salt and fat, eat it up.  Top that with their premium prices ($9 for 14 oz draught beer, really?) and consistently so-so service, and I can't understand why anyone that's been to the other ramen Toronto has to offer would come back here.  Visit once, to say you've been but don't visit again, because you know better.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.29353198409080505, 0.2004668414592743, 0.12993526458740234, 0.09956686943769455, 0.06165315955877304]}, {"sequence": "3.5 stars. That extra 0.5 star is for that BEAUTIFUL egg that sits inside the soup.Momofuku Noodle Bar is a two storied location that serves delicious ramen and delicious ice-cream service to satisfy your taste buds afterwards!Knowing that Momofuku noodle bar was a hype and hip place in the Hospital District in Downtown Toronto, my friend had offered to bring me there to try it out. Lunch services on regular weekday was PACKED. This place must be really good. We had to make reservations for a table because it was booming with business. We decided to try their iconic Shoyu Pork Ramen ($16). It came with a delicious pork belly, BEAUTIFUL egg with a golden yellow centre, and some delicious noodles. It was definitely tasty, but after tax and tip, $20 for a bowl of this kind of ramen, was not worth it for the money in my opinion. Although the atmosphere is beautiful, we were sitting in shared tables and no space to place our belongings except on the floor. There was a small coat rack near the front entrance, which really wasn't enough for the amount of guests that Momofuku holds. The ramen was delicious, but having some delicious ramen in Japan, or even other parts of Toronto, $20 for this bowl of ramen was really for the prime location in Downtown Toronto on University Street, the beautiful exterior and interior of the building and the branded name.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "A cafe that also offers beer"], "scores": [0.10263509303331375, 0.02960136905312538, 0.0158561859279871, 0.014551026746630669, 0.008967234753072262]}, {"sequence": "I love pork belly. I could have it every day, but then I will have a pork belly. We went there late on a Thursday evening. No problem with seating as we were given a table upstairs.Good service throughout except at the end when we needed to track down the waitress for the check.Liked- pork belly buns- shoyu ramen- numerous beer choicesThe spicy noodles were very spicy. They warn you a few times that it is spicy. Believe them!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.7067696452140808, 0.09627780318260193, 0.00491848960518837, 0.003041165182366967, 0.0013504719827324152]}, {"sequence": "This place is SO bad. If you insist on coming here on the strength of the Momofoku brand, despite repeated warnings from your friends who live in the area that it is REALLY bad, then just go ahead and make a mental note of where you'd theoretically like to eat AFTER coming here so you can go there right after because if you have had a chance to sample other ramen places in Toronto then you will leave Momofoku disappointed and hungry. The shoyu pork belly ramen here is the worst in Toronto. It's seriously so low effort. It kinda tastes like Mami brand ramen in a packet if you let it sit for 3 days. We tried 3 different buns hoping that we would luck out on something that we actually liked. Tried the chilled shrimp, pork belly, and roast beef bun. All awful. Like the ramen, low in flavour and no effort on presentation whatsoever.  Check my pics. I'm still in disbelief that food this quality is being served in such a prime location.Oh and the desserts here are the most low-effort thing of all. You have to go to the back and pick out prepackaged cookies which I believe were like 3 dollars per cookie. They were so hard and tough you could bang the cookie against the edge of your table and it will not crumble or bend. Unreal.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.18269217014312744, 0.07925978302955627, 0.057801730930805206, 0.02698984183371067, 0.021161440759897232]}, {"sequence": "OKONOMIYAKI: Not something I would have thought to order, but boy am I glad it was put in front of me. My girlfriend wanted to look up how to make the sauce herself, it tasted so good.CHICKEN WINGS: I'd heard great things about these and what I heard was true. They not only taste good but, for wings, are surprisingly clean to eat.PORK BUNS: Still bloody amazing. I'd eat my weight in them.SERVICE: Still excellent.OVERALL: So, full disclosure, I did have the privilege of eating this meal for free. However, I'd encourage you not to disregard what I've said as I assure you I'm not so desperate for food as to be bribed with it! Nor did this feel like a bribe. Instead it struck me as a restaurant quite fairly asking for another opportunity to prove themselves.And they did! My opinion of Momofuku definitely went up after getting to sample more of the menu. I think this is a great place to order several appetizers and other smaller dishes, from the Etc. section of the menu, to share.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.5566456317901611, 0.02579500898718834, 0.02342783473432064, 0.011824888177216053, 0.008441436104476452]}, {"sequence": "In A Nutshell:-Pai is different than your usual Thai restaurant.-It's a blend of hipster & Thai food.-It can get very crowded, regardless of the day of the week.-The layout is very dark & cozy.-The food options are easy to order and you can control the level of spice to your tongue's desire.-The betel leave wraps are very unique & hard to find outside of Thailand, so order that.Overall, I recommend coming to eat here.  If you want to make reservations, do so in advance.  They won't take dame day reservations bc this place is BUSY & POPULAR.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.024690454825758934, 0.009722701273858547, 0.00635210145264864, 0.003424865659326315, 0.0009683944517746568]}, {"sequence": "Came here twice and had the vegetarian spring rolls, grabong, chicken pad thai and Thai iced tea ice cream  Everything we tried was absolutely delicious! I'm not a big fan of spring rolls but these were amazing! The grabong - butternut squash fritters were so yummy and not at all greasy. The pad thai was perfect - not too sweet at all and the Thai iced tea ice cream was the perfect dessert. This is one of my favourite Thai restaurants. We also sat at the traditional Thai seating area where you take off your shoes and sit on a cushion which I wouldn't recommend because it was very uncomfortable. I would recommend this restaurant to anyone and can't wait to come back for the 3rd time.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.01860596239566803, 0.01679961569607258, 0.0018003258155658841, 0.0006621741922572255, 0.0005440619424916804]}, {"sequence": "After one failed attempt, we finally made it in to give Pai a try. The first time, it was lunchtime on a weekday and two sleeping toddlers in strollers. There was no ramp/elevator so we had to choose a different location if we wanted to have a peaceful lunch (which we did end up having elsewhere). We had tickets to the Royal Alexandra Theatre and thought that this would be the perfect time for a second attempt. As we passed by at 5:25pm, we noticed the line up already out the door. I ended up jumping out of the car while hubby went to look for parking. There's a line to get a buzzer and I was pleasantly surprised when I got to the host desk that it would only be a 15-20min wait. Although it looks small, the restaurant is actually quite large and can seat lots of people. We ended up eating about 20 minutes and was led to the back area. We passed a couple of \"traditional\" mat-on-floor type raised seating. The decor reminded me of a street food type setting. The menu is in Thai so I needed to read the translated explanations. When we were waiting I saw a bunch of mango sticky rices pass by so I knew I wanted to leave room for those. We bypassed the appies and got a Pad Thai (I wanted to compare with Royal Orchid and one in Grand Cayman which is so far the BEST tasting Pad Thai I've had), and a green curry with chicken served in a young coconut. We also got two iced teas. When I asked if they came pre-sweetened, I should've asked if the level of sweetness could be customized since other places typically make it too sweet for my liking. This one was just that. I'll have to ask next time around if we come back. We found that the wait was a bit long... over 15 minutes for the food to come out.  The Pad Thai was served with grated cabbage just like the Caymans so I was excited. The tamarind sauce was sweet, like Royal Orchid's but didn't have that savory flavour like the one in the Caymans (good thing we are going back! Can't wait!!!). So flavour was ok but the noodles were complete stuck together in a mass. Maybe too soft? Not enough oil?  I don't know. The green curry was nice and anything they couldn't fit into the coconut was served in a separate bowl. Mango sticky rice came nicely carved and on regular sticky rice. I've had ones served on purple sticky rice which gives it a nice texture. Flavour wise it was good but a bit skimpy on the mango. This dish was quite small for the $10 price tag. All-in-all, I'd say it's an average Thai restaurant. I wouldn't drive downtown and wait in line when I could have the same quality food uptown without lineups and free parking.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.09939219057559967, 0.04513417184352875, 0.029621992260217667, 0.018353350460529327, 0.0008284859941340983]}, {"sequence": "This place is amazing! The atmosphere is trendy and cute. The food is so good. The best pad Thai I've ever had! I highly recommend going here. They have thai iced tea and amazing cocktails. I feel this is a hidden place but I'm so glad I found this place on Yelp because it was the best place I ate during my Toronto weekend!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.1962844580411911, 0.03382410854101181, 0.002507565775886178, 0.00046323976130224764, 0.0002597077691461891]}, {"sequence": "The high rating is well deserved. Pai is just delicious Thai food plain and simple. I've been a few times, it's always packed. The ambience is rustic and nice. It's kind of a basement but it's a big open space with cute lighting, good vibe but still pretty cozy. It's busy without being overwhelming. The service is really efficient considering how busy they are. I had their green curry which comes in a coconut - honestly I was enticed by that just for the look but it's also a young coconut and you can scrape off the coconut meat! The grabong app is really great to share. It's really like French fries made from squash- really nice. I had their rotating tap beer which I can't recall but was greatThis is definitely must try place in Toronto. I'm glad they continue to go strong. If it were closer to me I would definitely be a regular.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.172522634267807, 0.001995550701394677, 0.0006528571248054504, 0.000639814417809248, 0.0001765053311828524]}, {"sequence": "One of my favourite gelato places ever, and I visit a lot of gelato places (well I have in the past before I found this place - and before Yelp days).It's simple but complex...the flavours are atypical but so delicious. Why have I only tried the mango though...The storefronts are contemporary. I've been to both locations and the Baldwin location is very quaint complete with patterned yellow wallpaper. I've been eying the gelato bars for some time now, and I finally decided to get one - BEST DECISION EVER. Yes, it's pricey. But it sure is delicious. The jasmine gelato interior is so nicely complemented with a white chocolate exterior and great crunch from the pecans. As I mentioned they have unique gelato flavours as well such as various teas. I look forward to my next visit!", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.05838000029325485, 0.004017781000584364, 0.0032494314946234226, 0.001339500304311514, 0.0009464898030273616]}, {"sequence": "Pretty good asian flavour gelato. They don't have the typical european flavours but they do have nice asian flavours such as durian, jasmine tea, and black sesame.Taste was quite good. Really enjoyed the flavours but the gelato wasn't creamy enough. Was still a solid place for gelato.", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.11516822874546051, 0.005160926375538111, 0.0031244177371263504, 0.0003969500248786062, 0.00035444897366687655]}, {"sequence": "Kekou Gelato is my go to whenever I'm in the area. I actually find myself making an excuse to visit the area just to grab some gelato! I love the selection of asian flavours and everything is made from scratch. My favourites are the HK Milk Tea, and Vietnamese Coffee. I have also tried the Rosewater Pistachio and Rum and Condensed Milk and they did not disappoint!", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.0025963594671338797, 0.0018223663792014122, 0.0012896002735942602, 0.0002519986592233181, 5.285806400934234e-05]}, {"sequence": "Probably the best gelato place if you're looking for flavours that aren't regularly offered. They have some alcoholic ones, where you can taste the alcohol. They have durian and HK milk tea. But my all time favourite would have to be the rosewater pistachio. I always come for some and once you've had it, you can't go anywhere else. The decor is very cute. The place is really small but there are seats outside. Enjoy that gelato outside in the sun!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.06547931581735611, 0.01872800663113594, 0.0036881272681057453, 0.0031229753512889147, 0.0010658146347850561]}, {"sequence": "Love the gelato flavours from here! They have a unique combination of flavours, which is what makes Kekou unique. My favourite is Hong Kong milk tea.My only complaint is that it's not opened year round and that the shop opens only in the afternoon. Otherwise, the shop is very cosy and worth a visit!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.008173782378435135, 0.0043194107711315155, 0.0011448460863903165, 0.0005101722199469805, 0.00013615400530397892]}, {"sequence": "One of my faves in the city! Always great service and the ramen is delicious. I go often with my colleagues and we've never had any problems getting sat (but we are usually the first ones there when it opens).  I go for the black sesame or the spicy miso.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.022562894970178604, 0.00902317650616169, 0.0005321406642906368, 0.0004931990406475961, 3.334400389576331e-05]}, {"sequence": "Very best spicy miso broth and it is very tasty. The noodles are great and they even offer wooden spoons to sip with. Overall, just simply amazing and hidden gem.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.9110250473022461, 0.04804620519280434, 0.020198797807097435, 9.869039786281064e-05, 5.9697737015085295e-05]}, {"sequence": "Ramen Isshin has been hands down my favourite ramen in Toronto for a long time. All their ramen dishes are amazing and all are worth a try!They have lunch specials where you pay a bit more to add an appetizer and drink to your ramen. It's a great deal, especially if you're one of those who would rather enjoy their piping hot ramen with an appetizer and a cold soda drink.My favourite and go-to order at Isshin is the lunch special with white sesame shio ramen and takoyaki. The white sesame shio ramen comes with sesame seeds you can grind up to add some extra flavour. It's a bit of manual work, but the experience is what makes it worth it. The bowl itself is so much different from all their other bowls in how rich and creamy it is, and it's perfectly complemented by the sweet and savory taste of the takoyaki.Ramen Isshin is very popular though, so arrive a bit early if you want to be seated immediately. Or just wait in line, I'm sure it will definitely be worth it.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.2681991457939148, 0.06781017035245895, 0.034761976450681686, 0.027628151699900627, 0.021488593891263008]}, {"sequence": "Ramen Isshin is hands down the best ramen I've had. Granted, I'm not generally a huge ramen fan. The idea of noodles and broth has never struck me as particularly exciting. I of course understand that there's a stark difference between chicken noodle soup and ramen - I mean more conceptually.Ramen Isshin has made me a convert. It delivers on the unique qualities of a great ramen  - rich, flavourful broth, succulent noodles, the right combination of garlic/salt/spice - but then elevates the whole experience with an inventiveness only a great and passionate chef could muster. I got the Red Dragon. Besides ticking all the box's I just mentioned, it also had this mild sweetness to it. I generally don't like much sweetness in a savoury dish, but this somehow pulled everything together really nicely, almost as thought the ingredients were naturally sweet. I doubt no sugar was added, but the point is that it worked. Really, really well. The pork itself was lovely. I'm not a big pork guy, but the flavour of the meat wasn't at all aggressive which I appreciated. The sprouts added an awesome crunch, along with the peanuts. Loved the chilli flake oil on top as well. The dish itself was also really beautifully presented. I wasn't starving going in, but got hungry the moment I was served. Finally, it's worth pointing out that the Red Dragon isn't exactly cheap - it came to just over $20 after tax and tip, so high for ramen. Still, definitely worth it.Besides being deeply satisfying and delicious", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.37995144724845886, 0.3789736032485962, 0.3334624767303467, 0.14807862043380737, 0.14709365367889404]}, {"sequence": "After several recent mediocre ramen meals in my hometown, I find myself yearning for another experience at Ramen Isshin. The welcoming \"Irasshaimase!\" wide seating, prompt and warm service and obviously amazing food still resonates in my soul and stomach several months later. Like a user, I'm itching for another chance to go back and have another crack at their menu. I gravitate towards the spicy miso ramen, accompanied by their juicy chicken karaage. The broth is SO FLAVORFUL and not too heavy, and the noodles are chewy and never too hard. The eggs are perfectly semi-boiled and have crisp veggies. I really can't get enough of this place! The prices are very good for the immense portions of meals you get and the sake selection are obscure enough to have you keep coming back for more. One of these summer days I'll be brave enough to try their cold lemon honey ramen.The rule is simple: if you come to Toronto, you MUST come eat at Ramen Isshin!", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.16588188707828522, 0.061507448554039, 0.012091368436813354, 0.008987078443169594, 0.004027677234262228]}, {"sequence": "Classic Shang Hai place for me to go, sometimes it can get quite busy especially when it's peak time. Go to order usually includes XLB, some type of noodles, veggie dumplings and green onion pancake!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.025689994916319847, 0.0005162987508811057, 0.00011079508840339258, 9.451016376260668e-05, 5.5452055676141754e-05]}, {"sequence": "Was not impressed in my last visit, to start the seater was more interested in chatting with her coworkers than her actual role in seating people. Huge bottleneck at the entrance with many tables unreserved free \"in case a bigger party comes\". Food was a mix, pricing was ok but leaning more to overpriced. Some dishes met expectations, others I would definitely never again.", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.7573649287223816, 0.6203568577766418, 0.42348527908325195, 0.2846056818962097, 0.030011484399437904]}, {"sequence": "I was slightly disappointed with the menu. Thought this place would have more of a variety in food.  It is also a bit pricey.  They are known for there Xiao Long Bao (soup dumplings) and they are amazing!  I also ordered there Spicy wonton in chili sauce which was also  deelish!  However, if you're expecting a larger variety in the menu, this is not the place for you.  The only memorable thing about this place was there soup wontons and that was about it.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.4076947271823883, 0.21973851323127747, 0.022442849352955818, 0.011226261034607887, 0.009666071273386478]}, {"sequence": "Won Ton pork dumpling soup .. pork in the dumpling is minced .. I've had better but it's quite acceptable .. especially when you're hungry ..Dim Sum is better than I expected ..I shall return .. ( a good sign .. )", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.005177482962608337, 0.0010455908486619592, 0.00027636525919660926, 5.813654570374638e-05, 4.350189192336984e-05]}, {"sequence": "March 31, 2018 - the soup dumplings are delicious *a must try* but there is a red sauce (I forgot to order it, I think it's vinegar.. it tasted great with the soup dumplings when I first went to DTF). The other dish had pork with rice in it (i don't remember the name)", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.19633758068084717, 0.011043062433600426, 0.0030487384647130966, 0.00011633596295723692, 0.00011238471779506654]}, {"sequence": "Stopped in for a late night bite. Yum! The place was packed but good turnover so no wait time. They offer  $40pp sampling menu but we decided to go à la carte. Started with 2 bowls of MISO SHIRU (miso soup, $3.50) which was flavourful but a bit too heavy on the bonito for my taste.  The TAKOWASABI ($5.30) was cool-spicy-deliciousness: chopped tender octopus in biting wasabi served slightly chilled, a great starter or snack with drinks.  First hot dish was the KAKIMAYO ($9.30), baked oysters with spinach, mushrooms, garlic mayo and cheese. I think we found 4 tiny oysters total in the dish but it was still super delicious. They should really offer a vegetarian version with all mushrooms and no oyster at all.  Next we had the highly recommended BRIE CHEESE ($8.90). I was sceptical and happily proven wrong. Gooey warm brie deep fried in a crisp golden crust served over not-too-sweet mango and berry coulis. Wow. In retrospect, it's deep fried cheese... how can that go wrong?  Then came the meat. KARUBI ($9.9) a tiny plate of bland, sad-looking, cardboard-thin beef ribs served with a bowl of oil. We were expecting something salty-sweet & charred like Korean galbi, but alas thiskarubi dish was a disaster. After the first bite I declined to eat any more, it was so disappointing.Finally the TONTORO ($8.50) grilled pork cheek skewer. Worst pork cheek I've ever had. Tough and chewy. When is cheek meat ever chewy??   I can't even.To drink: OOLONG HIGH ($8.30) vodka & oolong tea over ice. Cool and refreshing in all the right ways and no sugar!!! Loved every drop.The ambiance was loud and rowdy as expected; lots of fun. Service was great at the beginning but slowed down exponentially with each dish. Frozen grapes served with the bill are a great touch. Would definitely go back again but stick to seafood and veg. Meat is NOT their forte.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.7650130987167358, 0.17157936096191406, 0.15686653554439545, 0.10271073132753372, 0.018946725875139236]}, {"sequence": "Great eating experience with a bunch of friends- highly recommend the sake bombs with a big group! Sharing food with a group of 4 is easy and the dishes are unique and tasty, Japanese fusion style. Great food for the price and would go again", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.6784682869911194, 0.024018727242946625, 0.0005870426539331675, 0.0001480912760598585, 5.2800245612161234e-05]}, {"sequence": "Talk about quick service! We were in and out in a half hour (3 dishes, no drinks).The salmon oshizushi left much to be desired as it tasted quite... plain? I usually opt for sushi rolls with salmon sashimi on the side (when eating at sushi places, not here), so maybe I'm just not used to this concept. The temperature and mild flavour did nothing for me. I will not be ordering this again.Moving onto the good stuff, the kakimayo was so freaking good. I was a little worried as I'd never had oyster before, but after seeing all the cheese, I'm pretty sure this tastes nothing like the raw thing anyway. It was more like cheesy mushroom bake, placed into a pretty dish. I'm already looking forward to eating this again.The gyōza was also good. I was taken aback by how much the filling looked and tasted like meat, but the dish is labelled as vegetarian! The presentation was unfortunately a little lacking though - those gyōza deserved more than a small bed of lettuce underneath them.Overall, the place was a lot louder than I expected. Seems like a great place to drink, but carrying a conversation is extremely difficult here! Even for those of us with loud voices.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.754832923412323, 0.4814676344394684, 0.08810995519161224, 0.07086873054504395, 0.021381575614213943]}, {"sequence": "This is my go-to for casual dinner. I love their menu selection, Ive came here often enough to have tried everything on their regular menu. The restaurant also has a featured menu with different selections every month. I've been to both North York and the downtown locations, and I've never had a bad experience. The restaurant is very loud, as you walk in all the waiters and waitresses will greet you all at once. It's not a place to go if you are trying to talk a lot- The patio is much quieter as an alternative during the summer time. Tables are small, but doesn't change the experience. I don't have many places I go to frequently but I find myself coming back a lot because the food/drinks is great. I Would suggest to make reservations to minimize the wait.My favourite thing to get was the Saba oshizushi that the waitress said was removed off the menu at the Church St. Location.. ( that was disappointing)", "labels": ["Japanese restaurant with pasta", "Italian place with a burger", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.3437623977661133, 0.010731770657002926, 0.004731023218482733, 0.001964931609109044, 0.0018693405436351895]}, {"sequence": "Kinkalicious! Came for the special promotion after a friend recommended. Made a reservation for 5:45 on a Saturday and was seated promptly. Server was friendly and introduced certain items and drinks. If you're going for the Kinkalicious event, it requires a minimum of two orders (29/person). It was a 7 course meal so here goes.....Sashimi sampler: My fav - lobster tail, salmon and scallop. Was nice, cold and fresh. Seaweed & tofu salad: Light and not too saucy. Fry plate (karage & takoyaki): didn't try the takoyaki, but karage was fried nicely and had a good crunchGrilled pork cheek skewers: A bit chewy for me, but the taste was decent. Baked oysters: Nice and cheesy! Had potatoes mixed in as well which complemented well. Mushroom & Cheese bibimbap: Was quite big considering the size of the other dishes, more toppings would have been nice.Matcha ice cream: nothing too special, but at least its a dessert! Service: expected the almost non stop shouting and enthusiasm, did not expect to be that rushed for time. We were told it was a 2 hr limit (understandable) but were promptly given the bill after 1 hr and 15 min.  Will return to try the other locations as well!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.05377209931612015, 0.0408480167388916, 0.029007190838456154, 0.027917912229895592, 0.004470571875572205]}, {"sequence": "Good beer spot in the distillery district - food was OK, service was friendly and the beers (large selection) were great. Tried the poutine and some other shared apps. No frills, pub grub and cold beer. Give it a try.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.15585431456565857, 0.0026185510214418173, 0.0010789551306515932, 0.0007408085511997342, 0.00025333676603622735]}, {"sequence": "Went to this place while being in distillery district. I would definitely recommend this place for a good dinner and a great beer. The place was really full but had an amazing service. Had the smoked meat poutine shareable (with no pickle), first time trying it and I was not disappoint, it was great, definitely something you want to order to share between 3 people. For dinner had the chicken fingers they were ok but the night was all about the poutine.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.47312936186790466, 0.0010693770600482821, 0.000498393434099853, 0.00040757926763035357, 0.00026669044746086]}, {"sequence": "Thoroughly enjoyed the chicken wings in garlic honey sauce. Also ordered a side of Korean sauce to try as well. Garlic honey sauce was much better. Sauce had a real nice garlic flavor. Korean sauce was a bit to salty for my taste. Chicken wings were cooked perfectly! Plump and juicy. We also ordered the Pierogies. The onions were caramelized perfectly. Bacon was cooked perfectly crisp. We'd definitely order these two dishes again.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Japanese restaurant with pasta"], "scores": [0.3094082474708557, 0.01372283324599266, 0.0059393420815467834, 0.0033758538775146008, 0.002230056095868349]}, {"sequence": "We have booked NYE at Millstreet Brew Hall a few times and it always was a good time. This year it was dead but the Brew Pub was full and had a live band so we moved there. The \"beverage manager\" was quite rude and arrogant all evening. I was not pleased with house she handled our table and spoke to us. Coming from a service background, her fake smile and attitude was not acceptable in a customer service position. I would not recommend the brew pub but would highly recommend walking through to the beer hall, where the wait staff are polite and friendly.", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea"], "scores": [0.04327799752354622, 0.04146582633256912, 0.03263978287577629, 0.021582581102848053, 0.00694907596334815]}, {"sequence": "Disclaimer: I only drank the beer.  Never had the food but the friendly bar tender and help staff made for a great experience.  The beer was good and cold and it was a great bar for a rainy afternoon in toronto.", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.21250760555267334, 0.004287474323064089, 0.0032081070821732283, 0.0011872901814058423, 0.0004715434624813497]}, {"sequence": "My foodie roommate, Keith, says Bang Bang is \"the best ice cream he's ever had.\" That sums up our experience at Bang Bang. It's a TINY ice cream shop that has rightfully won countless awards and nods from food publications for their ice cream and ice cream sandwiches. It's just north of West Queen street in between West Queen and Dundas and on a street with countless of top rated shops and restaurants. If you go, go on a week day and early. It opens at 3pm and most days they have a line even before it opens. We went on a Wednesdays at 4pm and only waited 15 minutes.Due to time, they only let you sample one flavor so pick wisely. I ordered the campfire marshmallow ice cream (nope, it wasn't too smokey) with their \"stay classy\" cookies (basically chocolate chip cookies). It was worth every penny. Note: There's an ATM inside, but it's not cash only. They take cards!", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.13087135553359985, 0.015962524339556694, 0.01101396419107914, 0.00995754636824131, 0.009321102872490883]}, {"sequence": "O.M.GI dream about this place in my dreams every night and I eagerly await the day that I will be reunite with my half ice cream sammie. Yes the line is long but it moves fast. The ice cream flavours are out of this world and some even come with the opportunity for customization (hellooo mango sticky rice with sticky rice). Cookies are delicious and chewy, I had to hold myself back to not buy a dozen. Highlights of my visit was definitely the lemon hinted birthday cake cookie and the mango sticky rice ice cream.", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "Italian place with a burger"], "scores": [0.1814577430486679, 0.021997293457388878, 0.00881518330425024, 0.0022691041231155396, 0.0017669498920440674]}, {"sequence": "This place is an ice cream lover's wildest dream. They offer 20+ flavours, some classics like chocolate or matcha, other more original like avocado or London Fog. The ice cream is soft, creamy and exploding with flavour. I highly recommend waiting for a waffle cone (takes about 10 minutes to prepare depending on how busy it is). Alternatively, they also sell cookies and you can get a ice cream sandwich.10/10 would recommend.", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.09356987476348877, 0.0027867567259818316, 0.0005826649139635265, 0.00044897155021317303, 0.0003410811477806419]}, {"sequence": "Being in Toronto for the day, the is a must try. Heard about the long lines so we tried to get here early. Arrived at around 6 and there was a small line in front with about a ten minute wait for the bubble waffle cones. I got the bubble style waffle cone with a scoop of the lychee rosewater with raspberry curd and a scoop of the totaro. The lychee was very lovely and subtle with the raspberry curd around it adding to the sweetness. The totaro with is purple yam and coconut was also very good, for fans of taro and the like. Overall I'm glad I got a chance to come even if I had to walk a lot to get here!", "labels": ["A cafe that also offers beer", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.0640752911567688, 0.017688453197479248, 0.0035617395769804716, 0.001303955796174705, 0.0011800049105659127]}, {"sequence": "//SERVICE// *Updated May 19/2018*The cashiers now LIMIT ONE TESTER PER PERSON. There's a sign that says this applies when there's a line-up, BUT I went during a time on a chilly rainy day and there was LITERALLY NO ONE BEHIND ME, and one of the cashiers was still unwilling to give me an extra tester. That's kind of lame Bang Bang...at least limit it to two testers or else how are people going to decide on getting one or two flavours??//OVERALL//Although I haven't been liking the service at bang bang lately, their ice cream is great and I'll begrudgingly come back for more...haha", "labels": ["An ice cream shop with bubble tea", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta"], "scores": [0.684019923210144, 0.12647399306297302, 0.03343438729643822, 0.012616035528481007, 0.010812330059707165]}, {"sequence": "Not going to lie, I only came here to get the Estrella Dam for the Winterlicious contest lol First impression of Bannock is that the place is way smaller than I thought it would be. And it's a little weird that you can see into the bay while you're dining. I don't know, dining experience really matters for me and it kind of felt like my friend and I were elbows to elbows with the table next to us. I certainly won't be craving anything I tried but the food was good, one of the better winterlicious restaurants I've tried for sure. Definitely recommend: -pear salad (really good, it was tangy but not too much. I really liked it) -duck leg (very juicy, highlight of the meal)-rice pudding (has granola its at the top, very fragrant and tasty)Those are totally not the names of the dishes at all but they were really yummy and that's all I really remember about them. Don't know if I would come back but I say it's worth a try", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.02882004715502262, 0.015401688404381275, 0.008282451890408993, 0.0029215971007943153, 0.002518599620088935]}, {"sequence": "I came here the other day for a quick bite and the weather wasn't very nice - very rainy in fact, but i stopped by for a quick coffee and some appetizers. They have two sections - one for dine-in, and one for grab and go. Becuase I wasn't staying long, I went to the grab and go section. I ordered a Cortado and their GRIDDLED FISH \"BANNACOS\" - recommended by the girl who was serving me at the counter :) it did not disappoint!The fish tacos were presented beautifully along with a apple cucumber salad :) the fish was nice and crispy, and the seasoning and garnishes with the taco was excellent! They used a bit more sour cream than i would like, but all in all the tacos were very tasty and i love the presentation of the apple cucumber salad on a lettuce leaf :) I was also surprised by the coffee! I didn't think it would be a place where i instantly would think great coffee, but they cortado was great! the expresso was done very well, lots of foam and I enjoyed my drink very much. The only hiccup was i forgot to tell the girl i'm lactose intolerant, so it was done with regular milk... but I did take my enzyme pills so all in all it wasn't too bad :) But next time I deifnitely will make a mental note to ask for lactose free milk!I definitely would consider coming back here to try some of their other dishes. Being a part of the O&B group, I did have certain expectations of their food and I'm glad to say I wasn't disappointed!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.21928976476192474, 0.08152730017900467, 0.044613152742385864, 0.020349396392703056, 0.012480493634939194]}, {"sequence": "Finally came back to give this place another try after a fairly bad experience a few years ago. I came with a group of friends. I'm raising the rating to three stars for Bannock.The service was good this time around, server was friendly and attentive. The food was only OK for me. Myself and a friend each ordered the Roasted Duck poutine pizza and they both came out cold. Another ordered a burger which also had issues with the temperature. The restaurant did take them back and remade them completely.Overall the flavour was OK, but the portion for the pizza was huge. I had to pack it to go.Overall I was satisfied with my meal but it came out to $30 for a poutine pizza, a lot more options at that price level.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "An ice cream shop with bubble tea", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.33999913930892944, 0.040116459131240845, 0.028974739834666252, 0.02783133275806904, 0.013541004620492458]}, {"sequence": "Comfort food at its finest. Who doesn't want to indulge in a chicken pot pie or tourtiere on a cold winter day? Bannock serves up what cold Canadians are looking for in a meal. On this occasion I was craving a greasy meal after a long day at work. The cheeseburger immediately jumped off the menu and I just had to have it. The burger is accompanied by Taro chips, but I swapped them for fries, which were perfectly crispy.I'll start by saying that the meat they used for the burger was juicy and delicious. It's unfortunate that they hid the taste of the beef with 6 pieces of lettuce and a sauce that I couldn't figure out. Tip: take off the top bun and the lettuce and taste the beef on its own. You'll continue to want to eat this burger with a fork and knife.I love bannock and many things on their menu. On my next visit, I have to try the raved about duck poutine pizza. Stay tuned!", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.327720582485199, 0.04466812685132027, 0.006634916644543409, 0.0036272366996854544, 0.0008006015559658408]}, {"sequence": "I've been here twice and both times I've enjoyed the food and atmosphere. The restaurant is split into the Dining in section and the take-out section. The take-out section is to the right and there's some pre-made sandwiches, salads and pastries. The sandwiches are pretty good, and there is some seating in case you want have a coffee or have a quick lunch. To the left there is the Dine-in section that's also good. I brought a friend here for her birthday lunch and we both enjoyed our dishes. They have some interesting twists on some classics. I would come back if I was in the area for lunch. Keep Eating, Angela", "labels": ["Italian place with a burger", "Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.3265294134616852, 0.2938690483570099, 0.1822601705789566, 0.015867793932557106, 0.002303392393514514]}, {"sequence": "I can get an appetizer, entree, and dessert here without breaking the bank. I wish I lived closer so I could have affordable meals everyday.Manpuku is a favourite among students since all their dishes are under $10. In fact, you could spend $10 here and leave very full. I usually order their curry udon which leaves me quite full despite what the price may suggest. It comes with soup, udon noodles, and their curry on top. I like to drink the soup first and then mix the udon noodles with the remaining curry so it doesn't wash out the curry flavour. It's a comfort meal that costs under $8, so if you like udon and curry, this is a must order!For appetizers, I normally get their tofu nuggets. They're brushed with a sweet and sour sauce and packed with edamame and carrots for an awesome change up in texture. If you're thinking of getting a dessert, I would definitely say go for it. I've had their tofu cheesecake and mango cheesecake - personally, I prefer the mango. There's no crust, unlike the tofu cheesecake, but the mango flavour comes through nicely. This comes in at $3.50 (I think).In total, our bill came to under $50 when 3 of us each ordered an app, entree, and dessert. Amazing deal and place! I'll be back soon.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.18559379875659943, 0.13773714005947113, 0.02922152914106846, 0.022402504459023476, 0.015261861495673656]}, {"sequence": "OMG WOW.  This place is hidden inside a run down food court with half the places being closed at 6pm! But so so so worth going here. The food is simple, tastes great and the prices are dirt cheap. Like really cheap. I know I'm used to NYC pricing but $3.50 - $6.50 for a bowl of Udon that will satisfy is cheap based on any standards! The server was cute and efficient but they move fast so dont expect 5 star service. But that's not why you go here. Think Japanese street food in a sit down setting. If I lived in Toronto, they would know me by first name", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.08216483145952225, 0.04728550836443901, 0.001328206155449152, 0.0005361385992728174, 0.0002846795250661671]}, {"sequence": "I came here last year and have been meaning to go back ever since. We tried the vegetable curry udon, the manpuku ramen (chicken broth with beef), and the wasabi octopus. Both the noodle dishes were delicious and great portions for the price. The octopus on the other hand was very small and tasted just like a wad of wasabi. Overall good place to go for a noodle lunch, but it seems like their small side dishes are not as worth it. I also appreciated their complimentary hot tea. Will be going back again some time to have their takoyaki.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger"], "scores": [0.15349486470222473, 0.08478834480047226, 0.004007537383586168, 0.003338695503771305, 0.00255706999450922]}, {"sequence": "I ate here yesterday and the value was incredible. I had the beef udon & it was great value at just over $6. I also tried the curry don which had spectacular flavour.  I'd recommend either depending on preference Located just off of a food court Manpuku offers both takeout and dine in away from the actual food court. I'll definitely be back for the quality & price!", "labels": ["Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.31413593888282776, 0.026274623349308968, 0.015753010287880898, 0.003315266687422991, 0.002978794975206256]}, {"sequence": "Today was my first time going to this place. Before today, I have never heard of this place until a friend who went to the university across the street brought me there. The restaurant was small as it was tucked in a corner inside a food court. I noticed the menu only had donburi, udon, and some appetizers. We were seated quickly. The waitress were Japanese, so immediately I knew my udon would be more authentic compare to other Japanese udon place. We both ordered udon, with mine the Kitsune udon and hers the Kake udon. We also ordered some appetizers- takoyaki and yakionigiri (pan fried onigiri).The Kitsune udon didn't have much toppings, only a big piece of inari (sweet tofu skin), and two slices of Japanese fish cake. The portion of the udon was small, but the soup was tasty. The udon was cooked perfectly. However, the takoyaki... Well... let's just say I have had better ones. The ones at this restaurant were big, but don't get fooled by the look. It was 90% dough, 10% octopus. The yakionigiri... I don't know... It's salty on the outside, like they pan fried it with soy sauce. I personally not a fan of it. Overall, the food was not bad, but the price was CHEAP!! It's only around $5 for a bowl of udon. I will definitely recommend it if you are around the area and looking for CHEAP and TASTY Japanese udon.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.23446153104305267, 0.09697877615690231, 0.08563687652349472, 0.017078762874007225, 0.0006051494274288416]}, {"sequence": "Great spot, especially the rooftop patio, you get lots of fresh air and there's a DJ spinning some great tracks, perfect for the warm seasons. The food here is incredible, there was nothing I tried that I didn't like. I ordered the tuna poké bowl and was so full afterwards. Very very filling spot. I'd definitely come back for the vibes, food, and overall atmosphere. Customer service was great. I came here on a Sunday and between 2-5 they have specials so we ordered the sangria which was delicious and very refreshing especially because there's a bit of slush added in the glass. Probably one of my favourite sangrias in the GTA.My friend made resos for three so luckily we got a spot because this place fills up quickly.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.15541160106658936, 0.1507241129875183, 0.06521151959896088, 0.04509655758738518, 0.02050808072090149]}, {"sequence": "Considering how often I come here (almost weekly), I try to only write reviews if my experience is not typical. Yesterday evening it was exactly that. I met up with my cousin and a friend for drinks on the deck, we had previously made a reservation so our table was ready when the first person arrived. About half way through our evening, the manager, Liben came over to our table and asked if we would be opposed to moving tables since they had a large group coming in and wanted to combine ours with the two next to us. We obliged, moved, and continued to order drinks.A while later, we asked to pay our bill and the server came back to let us know our entire bill had been taken care of. We thanked Liben before we left and he was very kind and gave us his card for when we came back. Such great customer service!", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.4305083751678467, 0.17371907830238342, 0.14907847344875336, 0.026784492656588554, 0.020336437970399857]}, {"sequence": "I was seriously prepared to pass this place off as another mediocre restaurant that people consider to be the new hot spot but was blown away by how well they have everything together.First, reservations were easy to make online for a Friday, prime-time slot for a party of 5 for a friends birthday. Checking in and being seated immediately was also awesome.After being seated, we were attended to immediately for drinks and apps by a really cool server. After taking our drink orders and giving us some time to review the menu, the server took our order and was attentive onto when we needed refills for drinks. I ordered the Bang-Bang Sour beer and then a Summer Smash (highly recommend if you like mojitos!)Now, the food. Man. The food was on a much higher level than I thought. I initially came in thinking this place would disappoint on the food, that it was all flash but no. I got the Feenie burger (throwbacks to Boy Meets World days) which was named after the chef and it was delicious. More than delicious. I want another one. Like, now. My wife had the modern bowl with glazed salmon and usually those kind of things suck but everything about that dish was perfectly balanced. The salmon was also tender and not dry. They really had our order down.The prices were actually really reasonable for a place like this.I would definitely come back here.", "labels": ["A cafe that also offers beer", "Italian place with a burger", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea"], "scores": [0.7405628561973572, 0.7166534662246704, 0.41406187415122986, 0.23253212869167328, 0.08480153232812881]}, {"sequence": "\"oh my goodness... this is the best sangria ever!\"What time we arrived/Wait time?I made a reservation at 2:45pm on a Tuesday so we we did not have a wait time nor was the restaurant too busy at that time. The restaurant filled up almost completely by the time we left which was around 4:30pm. I was recommended this place by a co-worker because it is her go-to spot. She told me that if I HAD to go to the rooftop patio or else there was no point in going! So I made to sure to call ahead and request a spot on the patio. They told me that they only take requests in case of weather complications. It also seems like Cactus Club is composed of 3 different restaurants - each being on a different floor!Atmosphere?I absolutely was blown away by the interior of the rooftop. It is so so beautiful and such a fun environment. The music wasn't too loud either. There were fun couch seats around the edge, but we did not get seated there (I think those are for bigger groups). There are sheer, white curtains that I believe you can close if you wanted more privacy... it made the place look more like a resort and added a poise vibe.Service/Staff?It seemed as if all the servers were women. They weren't the friendliest but everything was brought to us in a timely manner so I have no real complaints. Food/Menu?The menu is a simple two pager which I like because when there are too many options then it gets really confusing for me to choose. For drinks- we started with the \"rose sangria\" and a \"signature sangria\". They both had sprite in them which made them fizzy and the flavours were AMAZING! We said they both tasted similar to slushies but the signature sangria was much better so get the one for sure!!!I have tried SO many sangrias in my life and that one in particular was very high up there. For mains - she recommended the chicken creole and the poke bowl so we each got that. The poke bowl was very fresh with the mangoes and salmon, and the chicken creole with asparagus/mashed potatoes was really tasty and simple. It was the perfect portion. Overall we loved loved loved this place and would totally go back!Would be so much for a night out for a friends birthday or even for a nice lunch.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "I am in search of a fancy Pakistani restaurant with authentic food", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.111992746591568, 0.09802453219890594, 0.06885387748479843, 0.06266418844461441, 0.031907595694065094]}, {"sequence": "Portions are super generous. My friend and I came here for a work lunch and shared the truffle fries. I got the grilled chicken modern bowl which came with Jasmine rice, salad, mango salsa, cous cous. My friend was craving the lettuce wraps since she had it two weeks ago at the Sherway Garden mall location. It was very delicious and very filling for an appetizer. If you were going to come in a group of 4 or more, the lettuce wraps appetizer alone will fill you up! Truffle fries were amazing as well, light truffle oil which I assumed were used and the dipping sauce which I believe was horseradish was a good side. We sat on the roof top level and they had the heaters on since it was cold out. Very nice and cozy. Overall, great atmosphere and good food!", "labels": ["A cafe that also offers beer", "I am in search of a fancy Pakistani restaurant with authentic food", "Italian place with a burger", "Japanese restaurant with pasta", "An ice cream shop with bubble tea"], "scores": [0.16071952879428864, 0.02992054633796215, 0.026922905817627907, 0.019999517127871513, 0.005916952155530453]}, {"sequence": "Is it just me or has kinton ramen decreased the size of all their pork ramen??!! One bowl of ramen used to be so much food but now it's barely enough for a hungry me.Size aside, kinton is pretty yummy but it leaves you with a salty and fatty taste in the mouth that is rather uncomfortable. Compared to other ramen places, I feel that kinton's broth only stands out because of its fattyness and not because of its umami.All in all, not bad when you want a small bowl of hot noodle soup but if you want the real deal, I'd recommend isshin or sensotei", "labels": ["I am in search of a fancy Pakistani restaurant with authentic food", "Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger"], "scores": [0.39815038442611694, 0.22647038102149963, 0.1249246597290039, 0.03590388596057892, 0.03259743005037308]}, {"sequence": "I'm pretty much here for lunch every other week. Very consistent and in the crazy summer heat they serve cold ramen noodles which you can dip into a delicious soy sauce. Absolutely wonderful!Truthfully their ramen soup is too salty for my liking so I normally go for heir appetizers like the rice (which always comes with kimchi) and gyoza. Everyonce in a while I get the karaagi original if I'm hungry.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.03610707446932793, 0.02330378070473671, 0.00029817281756550074, 0.0002786008408293128, 5.7095287047559395e-05]}, {"sequence": "This is a super belated review, as I came here last year at around Christmas time. I didn't have Yelp at that time, and only stumbled upon my photos now!Came here after visiting the Christmas market, and was very excited to slurp down some hot noodles and soup. We started off with some green tea, which was nicely packaged in mason jars (so hipster) - careful though, as they cost extra!We then ordered an appetizer of tako wasabi to share. This was my first time trying, and I loved it! It was delicious. We also got a side of takoyaki, which was decent. It definitely was quite soggy and the flavour fell flat. Nothing like what you'd get in Osaka, but I obviously can't compare Canadian standards to authentic Japanese cuisine!I ordered the original pork ramen, as I've heard it's what Kinton is famous for. Unfortunately, I was quite disappointed by the end result! The chashu, unlike what it should be, was literally pure fat. Although that may appeal to some people, I didn't find it to be the best companion to the meal. The broth was bone white, but for some reason, I found that it really did lack depth of flavour. It was fatty, for sure, but I've made ramen broth at home, and I really do think it was missing that collagen. I've had better broth at smaller ramen joints, and perhaps Kinton is just too large a franchise/business to really put as much effort into its broth anymore.Overall, it was okay, but would likely not return just for its ramen.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.23658107221126556, 0.14242428541183472, 0.042099859565496445, 0.037876665592193604, 0.0008952509379014373]}, {"sequence": "After a crazy week of midterms, assignments, project and presentation, I finally felt a little more relax today.   And it is such a wet and rainy day with gloomy weather.  I love the umami taste of miso with ramen, so good and so satsifying, but Kinto really fall short of my expectations.It was kind of condescending when I asked the server whether i can change my meal to a combo with gyoza and ramen noodle.  He was border line rude with his fool attitude.  I thought the servers in Japanese restaurants are usually really polite, but definitely not this one.  The long bench table was made out of cement with a protective layer on top which I thought was kind of interesting.  The seat I was on was really uncomfortable since the height was a little bit too high.  I guess this is to save space and there was a little compartment underneath the chair so you can pick your personal belongings.  It was functional but uncomfortable.The servers were not really responsive, but I think it might also be due to the setup of the restaurant which may not allow a nice view of the entire restaurant from every angle.  The miso ramen noodle was really tasty.  You can really taste the ramen noodles were freshly made.  The thin ramen noodle complement the rich soup base with charred bbq pork nicely slice and plate on top of the ramen, with a few sprinkle of sesame.  It was a really nicely flavoured pork belly that has good slightly firm texture and really nongreasy.  It is a good sign that the fat has been rendered out properly.  The slight charred taste on the bbq pork was a nice accent to the overall ramen flavour profile.  On a rainy day with rich umamai was the best way to finish off my crazy day.  The gyoza was crispy on the bottom, but not so juicy on the inside. The minced pork was a little bit overseasoned but taated fresh.  To be honest, I was a little bit disappointed with the gyoza, maybe I should have stuck with plan to make the meal into a combo with a steam gyoza instead.  The use of a small bamboo case to hold the bill was a nice touch to finish; however, the servers did not provide an outstanding service, so I decided only to tip them minimally.", "labels": ["A cafe that also offers beer", "Japanese restaurant with pasta", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.22503134608268738, 0.18828018009662628, 0.06592225283384323, 0.020571092143654823, 0.015318998135626316]}, {"sequence": "First time visiting Kinton although I have tried all the other ramen places in TO.  No wait at 12:45pm.  Our group was greeted very quickly to the bar in front of the kitchen.Very efficient and friendly service.  Food came quickly.  Spicy garlic ramen was delicious.  Only disappointment was that it did not come with egg or seawood.  Pork miso was very good as well.Waitress was very friendly.  Informed us about the instagram dessert freebie and that I can put my bag under the stool.  For the freebie, we had the roasted green tea pudding.  Adequate portion but since it's free, no complaints.  A refreshing way to end a meal on a summer day.Would definitely visit again.  Especially the location in richmond hill.", "labels": ["Japanese restaurant with pasta", "A cafe that also offers beer", "An ice cream shop with bubble tea", "Italian place with a burger", "I am in search of a fancy Pakistani restaurant with authentic food"], "scores": [0.21276015043258667, 0.14186155796051025, 0.06549254059791565, 0.022789563983678818, 0.0047216881066560745]}]